[
    {
        "nazwa_przedmiotu": "Corporate finance,",
        "kod_przedmiotu": "PG_00045304",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Finansów, ąęłóćżźńś,dź dż,,,,, ",
        "cel_przedmiotu": "Nabycie wiedzy i umiejętności do podejmowania decyzji finansowych na stanowiskach kierowniczych wyższego i średniego szczebla. ",
        "efekty_uczenia_sie": "[K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student potrafi identyfikować wiarygodne źródła informacji finansowych, takie jak bilans, raporty finansowe i dane rynkowe, które są istotne do analizy decyzji inwestycyjnych, zarządzania kapitałem obrotowym oraz oceny płynności i wartości przedsiębiorstwa. [SW2] Ocena wiedzy zawartej w prezentacji [K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student podejmuje kompetentne i etyczne decyzje finansowe, mające na celu tworzenie i utrzymanie wartości ekonomicznych, społecznych i środowiskowych w przedsiębiorstwie, uwzględniając optymalizację struktury kapitałowej, decyzje inwestycyjne oraz zarządzanie ryzykiem finansowym. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Student zdobywa nową wiedzę, analizując procesy ekonomiczno- finansowe w przedsiębiorstwie, identyfikując ich przyczyny oraz klasyfikując ich znaczenie dla organizacji [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu",
        "tresc_przedmiotu": "Istota i przedmiot zarządzania finansami; Analiza bilansu; Zarządzanie kapitałem obrotowym netto; Wartość płynności i optymalny poziom płynności; Decyzje inwestycyjne; Kontrakty forward i futures; Opcje i swapy; Koncepcje zarządzania wartością przedsiębiorstwa.  Data wygenerowania: 13.02.2025 13:23 Strona 2 z 2",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 15.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur 1. Berk J., Corporate Finance, Pearson Education Limited, 2016.  2. Vernimmen P., Quiry P., Dallocchio M., Le Fur Y., Salvi A., Corporate Finance: Theory and Practice, 4th Edition, 2014. 3. Damodaran A., Corporate Finance Theory & Practice, John Wiley & Sons, 2nd Edition, 2001. Uzupełniająca lista lektur 1.Praca zbiorowa, pod red. J. Szczepańskiego i L. Szyszko, PWE, Warszawa 2015.Finanse przedsiębiorstwa.  2.M. Sierpińska, T. Jachna, Metody podejmowania decyzji finansowych. Analiza przykładów i przypadków, PWN, 2015. 3.Golawska - Witkowska Gabriela, Rzeczycka Anna, Zalewski Henryk, Zarządzanie finansami przedsiębiorstwa, Oficyna Wydawnicza Branta, Bydgoszcz 2006.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Ustal na podstawie sprawozdania finansowego, którą strategię zarządzania kapitałem obrotowym netto stosuje przedsiębiorstwo.  Wymień modele zarządzania zapasami. Zdefiniuj pojęcie płynności w przedsiębiorstwie.",
        "plik": "372960.pdf"
    },
    {
        "nazwa_przedmiotu": "Artificial intelligence,",
        "kod_przedmiotu": "PG_00045310",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Architektury Systemów Komputerowych",
        "cel_przedmiotu": "Celem przedmiotu jest nauczenie studenta podstawowych paradygmatów sztucznej inteligencji ze szczególnym uwzględnieniem sieci neuronowych, algorytmów genetycznych i logiki rozmytej.  66/5000",
        "efekty_uczenia_sie": "[K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student potrafi znaleźć właściwą metodę rozwiązania zagadnienia na podstawie wiedzy uzyskanej w trakcie wykładu i zajęć praktycznych. [SW1] Ocena wiedzy faktograficznej [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student potrafi powiązać badane zjawiska i problemy oraz przypisać im właściwe metody rozwiązania. [SW1] Ocena wiedzy faktograficznej [K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Podczas zajęć projektowych i laboratoryjnych  oceniane są umiejętności studenta w znajdowaniu oryginalnych rozwiązań problemów, umiejętość wykorzystania narzędzi w postaci bibliotek i modeli, a także kompletność realizacji zadania. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu  Data wygenerowania: 12.02.2025 10:26 Strona 2 z 2",
        "tresc_przedmiotu": "1. Organizacja zajęć i zasady zaliczenia przedmiotu 2. Definicje dziedziny SI, przegląd metod i zastosowań 3. Filozofia SI 4. Metody szukania na grafach: wszerz, w głąb, Dijkstry, A* 5. Metody szukania na grafach: algorytmy mrówkowe 6. Metody szukania na grafach AND/OR: wprowadzenie 7. Metody szukania na grafach AND/OR: metody minimaks i alfa-beta 8. Metody szukania na grafach AND/OR: szachy komputerowe 9. Reprezentacja wiedzy i wnioskowanie: wprowadzenie do logiki pierwszego rzędu 10. Reprezentacja wiedzy i wnioskowanie: rezolucja 11. Reprezentacja wiedzy i wnioskowanie: przykłady i rozszerzenia 12. Reprezentacja wiedzy i wnioskowanie: ramy i logika opisowa 13. Wnioskowanie rozmyte: wnioskowanie Mamdaniego i Sugeno 14. Sieci Bayesowskie: wprowadzenie i rodzaje zastosowań 15. Sieci Bayesowskie: metody obliczania prawdopodobieństw 16. Metody uczenia maszyn: omówienie typów uczenia, algorytmów uczenia i struktur uczących się 17. Uczenie maszyn: algorytmy gradientowe i algorytm Levenberga Marquardta 18. Uczenie maszyn: algorytmy szukania przypadkowego i symulowanego wyżarzania 19. Uczenie maszyn: algorytmy ewolucyjne 20. Uczenie maszyn: programowanie genetyczne 21. Uczenie maszyn: algorytmy roju 22. Uczenie maszyn: algorytmy immunologiczne 23. Uczenie maszyn: sztuczne sieci neuronowe, struktury i podstawowe własności 24. Uczenie maszyn: sztuczne sieci neuronowe - uczenie z nauczycielem 25. Sztuczne sieci neuronowe - własności sieci rekurencyjnych 26. Uczenie maszyn: uczenie systemów rozmytych 27. Uczenie maszyn: algorytmy konstrukcji drzew decyzyjnych 28. Uczenie maszyn: prblemy generalizacji, wymiar VC i nierówność Vapnika 29. Uczenie ze wzmocnieniem: wprowadzenie i rodzaje wieloetapowych procesów decyzyjnych 30. Uczenie ze wzmocnieniem: algorytmy różnic czasowych 31. Uczenie bez nadzoru: poszukiwanie centrów klastrów i samoorganizujące się mapy cech 32. Systemy wieloagentowe i inteligencja zespołowa: przegląd problemów",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Jędruch W.: Sztuczna intrligencja: Materiały do wykładu, 220 str., Gdańsk, 2010  Russel S., Norvig P.: Artificial Intelligence, Prentice-Hall, London. 2009 Rutkowski L.: Metody i techniki sztucznej inteligencji, Wydawnictwo Naukowe PWN, Warszawa 2009. Uzupełniająca lista lektur Duch W., Korbicz J., Rutkowski L., Tadeusiewicz R.: Sieci neuronowe. AOW Exit, Warszawa 2000  Michalewicz Z.: Algorytmy genetyczne + struktury danych = programy ewolucyjne. WNT, Warszawa 2003 Żurada J., Barski M., Jędruch W.: Sztuczne sieci neuronowe. PWN, Warszawa 1996",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "372961.pdf"
    },
    {
        "nazwa_przedmiotu": "Ethics,",
        "kod_przedmiotu": "PG_00045308",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Filozofii i Metodologii Nauk",
        "cel_przedmiotu": "Celem zajęć jest zaznajomienie studentów z podstawowymi zagadnieniami etyki i psychologii moralności.",
        "efekty_uczenia_sie": "[K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student podejmuje kompetentne i etyczne decyzje, uwzględniając zasady etyki, prawa oraz odpowiedzialności społecznej. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_K01] wykazuje się świadomością kwestii prawnych, etycznych i różnorodności kulturowej, podejmując społecznie odpowiedzialne decyzje Student wykazuje się świadomością etycznych, prawnych i kulturowych aspektów podejmowania decyzji, uwzględniając zasady odpowiedzialności społecznej oraz różnorodność wartości w różnych kontekstach [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym Student analizuje procesy biznesowe uwzględniając etyczne aspekty decyzji oraz wyzwania współczesności, takie jak odpowiedzialność i tolerancja [SW2] Ocena wiedzy zawartej w prezentacji  Data wygenerowania: 13.02.2025 13:33 Strona 2 z 2",
        "tresc_przedmiotu": "Wprowadzenie do etyki. Etyka a moralność, etyka a religia. Podstawowe systemy etyczne: deontologizm, utylitaryzm, etyka cnoty. Historia etyki I: Grecja od Homera do epikureizmu. Historia etyki II: Od filozofii renesansu do Nietzschego. Etyka a religia I: chrześcijaństwo, judaizm, islam. Etyka a religia II: buddyzm, hinduizm, konfucjanizm. Etyka praktyczna: etyka seksualności. Wprowadzenie do psychologii i socjologii moralności jako badań nad uwarunkowaniami działań moralnych. Etyka środowiskowa i bioetyka. Filozofia polityki a etyka sfery publicznej. Rozwój kompetencji moralnych wg Kohlberga. Etyka XX wieku: Inny/Obcy. Moralność ponowoczesna w ujęciu Baumana. Etyka a wyzwania współczesności I: tolerancja, dialog, przemoc. Etyka a wyzwania współczesności II: relatywizm, heroizm, permisywizm, odpowiedzialność. Problem autonomiczności etyki",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur J. Hołówka, 2001, Etyka w działaniu, Warszawa: Prószyński i S-ka. A. MacIntyre, 2013. Krótka historia etyki. Warszawa: PWN. Przewodnik po etyce, pod. Red. P. Singera, Warszawa 2009, Książka i Wiedza. Uzupełniająca lista lektur L. Kołakowski. 1997. Mini-wykłady o maxi sprawach. Kraków: Znak.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania • Wymień 6 podstawowych systemów etycznych. • Czym jest utylitaryzm? • Wymień szczeble rozwoju moralnego Kohlberga i opisz je krótko. • Wyjaśnij pojęcia permisywizmu, emotywizmu, relatywizmu i sceptycyzmu moralnego. • Czym jest etyka cnoty? • Wymień podstawowe problemy etyk szczegółowych (etyki środowiskowej, etyki sfery publicznej, bioetyki, etyki seksualności).",
        "plik": "372962.pdf"
    },
    {
        "nazwa_przedmiotu": "Psychological aspects of assessment and decision making,",
        "kod_przedmiotu": "PG_00045306",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Przedsiębiorczości",
        "cel_przedmiotu": "- Zdobycie wiedzy dotyczącej ważnych mechanizmów psychologicznych, które rządzą procesami i rezultatami poznania społecznego oraz oceny ludzi i sytuacji.  - Zapoznanie się z psychologicznymi aspektami podejmowania decyzji, w tym zarówno racjonalnymi, przemyślanymi procesami, jak i uproszczonymi procesami heurystycznymi. - Uświadomienie sobie przez studenta jak te procesy działają w ważnych aspektach działalności człowieka, w tym decyzjach grupowych, finansowych, wiążących się z ryzykiem, powiązanych z percepcją czasu i innych ważnych wyborach życiowych.",
        "efekty_uczenia_sie": "[K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student podejmuje kompetentne i etyczne decyzje, biorąc pod uwagę psychologiczne, etyczne oraz kulturowe uwarunkowania procesu decyzyjnego [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_K01] wykazuje się świadomością kwestii prawnych, etycznych i różnorodności kulturowej, podejmując społecznie odpowiedzialne decyzje Student wykazuje się świadomością psychologicznych, etycznych i kulturowych aspektów podejmowania decyzji, uwzględniając heurystyki, odchylenia od racjonalności, różnice kulturowe oraz indywidualne i grupowe procesy decyzyjne [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [SK1] Ocena umiejętności pracy w grupie [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym Student analizuje psychologiczne aspekty oceny i podejmowania decyzji w kontekście biznesowym [SW2] Ocena wiedzy zawartej w prezentacji  Data wygenerowania: 13.02.2025 13:34 Strona 2 z 2",
        "tresc_przedmiotu": "Heurystyki i odchylenia od racjonalności w podejmowaniu decyzji; Racjonalne i optymalne decyzje; Różnice kulturowe odnoszące się do procesów decyzyjnych; Procesy wpływające na podejmowanie decyzji grupowych; Podejmowanie decyzji finansowych i psychologia pieniądza; Indywidualne różnice w podejmowaniu decyzji i stylach poznawczych; Poznanie społeczne - modele teoretyczne: ocena jednostek i sytuacji społecznych; Twórcze myślenie i podejmowanie decyzji; Wspieranie procesów decyzyjnych",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Kahneman, D. Pułapki myślenia. O myśleniu szybkim i wolnym. Media Rodzina. 2013  Maruszewski, T. Psychologia poznania. GWP. 2016 Nisbett, R. Geografia myślenia. Dlaczego ludzie wschodu i zachodu myślą inaczej. Smak Słowa. 2015 Uzupełniająca lista lektur Thaler, R.H., Sunstein, C. R. Impuls. Zysk i S-ka 2012",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Opisz działania heurystyki dostępności. W jaki sposób może ona prowadzić do trafnych oraz błędnych wniosków?  Zaproponuj metodę mogącą ograniczyć negatywne skutków ludzkich odchyleń od racjonalności we wnioskowaniu na podejmowane decyzje.",
        "plik": "372963.pdf"
    },
    {
        "nazwa_przedmiotu": "Business process modelling,",
        "kod_przedmiotu": "PG_00045364",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Zdobycie wiedzy i umiejętności w zakresie modelowania procesów w organizacji. Nabycie umiejętności posługiwania się narzędziami informatycznymi wykorzystywanymi do modelowania procesów w organizacji na przykładzie notacji BPMN.",
        "efekty_uczenia_sie": "[K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne buduje procesy w notacji BPMN, przeprowadza symulację procesu w wybranym narzędziu,  potrafi wskazać możliwości poprawy procesu na podstawie wyników raportu [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych wie jak pozyskać istotne informacje o procesach i wykorzystuje je do analizy i doskonalenia procesów [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym rozumie różnice między procesami realizowanymi w różnych obszarach organizacji i wskazuje relacje między nimi [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 13.02.2025 13:28 Strona 2 z 2",
        "tresc_przedmiotu": "Wykład: Definicje podstawowych pojęć (proces, proces biznesowy, modelowanie procesów). Ewolucja i rozwój pojęcia modelowania procesów biznesowych. Orientacja procesowa. Cele modelowania procesów. Cykl modelowania procesów. Identyfikacja i klasyfikacja procesów. Mapowanie procesów. Narzędzia informatyczne wykorzystywane do modelowania i symulacji procesów. Miary procesów. Notacja BPMN.  Laboratorium: Ćwiczenia umożliwiające zapoznanie się z aplikacją iGrafx. Ćwiczenia pozwalające utrwalić umiejętności związane z definiowaniem parametrów modelu (ustawienia uruchamiania, harmonogramy, zdarzenia, generatory, zasoby, atrybuty), parametrów elementów diagramu (dla czynności: sekcja zadanie, zasoby, atrybuty; dla bramek: sekcja wejścia i wyjścia; dla zdarzeń: sekcja wejścia i zadanie/po ukończeniu). Uruchamianie symulacji, analiza raportu. Optymalizacja przebiegu procesu. Realizacja indywidualnego projektu zgodnie z wytycznymi podanymi przez prowadzącego.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Hernes T. (2008), Understanding Organizatios as a Process. Theory for a tangled world, Routledge Taylor&Francis Group, London and New York  Dumas M., La Rosa M., Mendling J., Reijers H.A. (2013, 2018), Fundamentals of Business Process Management, Springer-Verlag GmbH Germany Kossak F. (at all) (2016),Hagenberg Business Process Modelling Method, Springer International Publishing Switzerland Uzupełniająca lista lektur Hewing M. (2014), Business Process Blueprinting. A Method for Customer-Oriented Business Process Modeling, Springer Fachmedien Wiesbaden",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Wykład:  Wskaż procesy podstawowe i pomocnicze w danej organizacji. Omów wykorzystanie trzech wybranych narzędzi wykorzystywanych do modelowania procesów. Oceń ich stosowanie do określonych sytuacji. Omów sposób budowy systemu pomiaru procesów. Laboratorium: Zbudować model procesu z wykorzystaniem notacji BPMN. Przeprowadzić eksperyment symulacyjny. Zinterpretować wyniki i wprowadzić udoskonalenia do procesu.",
        "plik": "372964.pdf"
    },
    {
        "nazwa_przedmiotu": "Marketing research,",
        "kod_przedmiotu": "PG_00053006",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Marketingu",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów ze różnymi metodami pozyskiwania i analizy informacji niezbędnych do prowadzenia działalności marketingowej.",
        "efekty_uczenia_sie": "[K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student potrafi planować i analizować dane przy wykorzystaniu różnych metod i narzędzi stosowanych w badaniach marketingowych [SU2] Ocena umiejętności analizy informacji [K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Student ma wiedzę dotyczącą różnych źródeł danych, metod ich zbierania oraz integrowania w zakresie badań marketingowych [SW1] Ocena wiedzy faktograficznej [K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student potrafi podejmować kompetentne i etyczne decyzje w procesie planowania i realizacji badań marketingowych [SK2] Ocena postępów pracy",
        "tresc_przedmiotu": "WYKŁAD Istota i typologia badań marketingowych; proces i projektowanie badania marketingowego; pomiar i jego poziomy; konstrukcja instrumentu pomiarowego na przykładzie kwestionariusza; pomiar postaw; proces doboru próby; kontrola, redukcja i kodowanie danych; wstępna analiza danych i podział metod analizy danych; dwuwymiarowe (współzależność zmiennych) i wielowymiarowe metody analizy danych (analiza skupień, metody porządkowania liniowego); wywiady niestandaryzowane i metody projekcyjne; obserwacje; procedury surveyowe (sondaże); wyznaczanie wielkości rynku; przykłady badań marketingowych; etyka badań marketingowych. LABORATORIUM Przedstawienie zadań laboratoryjnych w ramach badania koncepcji nowego produktu; omówienie struktury raportu; analiza i wybór koncepcji nowego produktu oraz jej dopracowanie (potrzeba, forma, technika); opracowanie karty koncepcji nowego produktu; sformułowanie problemów badawczych i wstępnej listy pytań; projektowanie pytań do kwestionariusza w zakresie diagnozowania potrzeb i sposobów ich zaspokajania; projektowanie pytań do kwestionariusza w zakresie oceny postaw wobec koncepcji, preferowanych funkcji i cech produktu oraz potencjalnych zachowań nabywczych; testowanie kwestionariusza i jego weryfikacja; projekt doboru próby do badania i zebranie danych; przygotowanie książki kodowej; redukcja danych i kategoryzacja odpowiedzi na pytania otwarte; kodowanie danych; tabulacja prosta i inne analizy danych; opracowanie wyników i wniosków; określenie ograniczeń badania; zintegrowanie opracowanych elementów w formie raportu.  Data wygenerowania: 11.04.2025 15:30 Strona 2 z 2",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Podstawy marketingu",
        "lista_lektur": "Podstawowa lista lektur D. D. Iacobucci, G.A. Churchill, \"Marketing Research: Methodological Foundations\", 11th ed., Earlie Lite Books, 2015 J. F. Hair, R. P. Bush, D. J. Ortinau, \"Essentials of Marketing Research\", McGraw-Hill Irwin, 2023 D. A. Aaker, V. Kumar, G. S. Day, \"Marketing Research\", Wiley John and Sons, 2007 Uzupełniająca lista lektur P. Hague, \"Marketing Research in Practice\", Kogan Page, 2021 M. J. Schmidt, S. Hollensen, \"Marketing Research. An International Approach\", Prentice Hall, 2006",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Przykładowe pytania: zdefiniuj pojęcie badań marketingowych; wymień etapy procesu badania marketingowego; przedstaw cele i sposoby przeprowadzania badań eksploracyjnych; wyjaśnij istotę badań panelowych; przedstaw regułę przyporządkowania liczb obiektom i przykład pytania na przedziałowym poziomie pomiaru; zbuduj pytanie w skali Likerta; wymień etapy procesu doboru próby; wyjaśnij istotę losowania warstwowego; zbuduj pytanie w skali pozycyjnej i przedstaw dla niego wypełniona książkę kodową; przedstaw ogólną postać tabulacji prostej; wyjaśnij istotę analizy skupień; wymień podstawowe metody gromadzenia danych pierwotnych; wyjaśnij istotę wywiadów pogłębionych; scharakteryzuj zogniskowane wywiady grupowe; na czym polega interrogacja i standaryzacja w procedurach surveyowych; zdefiniuj wywiad kwestionariuszowy; jakie są normy etyczne w zakresie przeprowadzania badań z dziećmi.",
        "plik": "372966.pdf"
    },
    {
        "nazwa_przedmiotu": "Data mining,",
        "kod_przedmiotu": "PG_00045365",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem przedmiotu jest przedstawienie studentom metod i procesów eksploracji danych. Prezentowane są główne zadania eksploracji, jak predykcja, klasyfikacja i segmentacja oraz algorytmy wykorzystywane w tych zadaniach.",
        "efekty_uczenia_sie": "[K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student projektuje proces eksploracji danych, przeprowadza ten proces i ocenia jego efekty [SU1] Ocena realizacji zadania [SU2] Ocena umiejętności analizy informacji [K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student jest w stanie wykorzystać podstawowe rodzaje eksploracji danych oraz utworzyć modele eksploracji Student ocenia utworzone modele [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student wymienia, prezentuje i wskazuje właściwe wykorzystanie struktur danych i algorytmów eksploracji danych [SW1] Ocena wiedzy faktograficznej",
        "tresc_przedmiotu": "1. Podstawowe zagadnienia eksploracji danych 2. Proces eksploracji danych i jego rola w ramach organizacji 3. Formy reprezentacji danych i wiedzy 4. Przegląd podstawowych rodzajów klasyfikatorów decyzyjnych 5. Drzewa decyzyjne 6. Reguły decyzyjne 7. Reguły asocjacyjne 8. Grupowanie danych 9. Przykład metody numerycznych w ramach eksploracji danych 10. Źródła i natura błędów w procesie eksploracji danych 11. Inżynieria wejścia i wyjścia 12. Inne techniki eksploracji danych",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur Literatura podstawowa:  Daniel T. Larose: \"Metody i modele eksploracji danych\", PWN 2008. Ian H. Witten, Eibe Frank: \"Data Mining: Practical Machine Learning Tools and Techniques\", Morgan Kaufmann 2005. David J. Hand, Padhraic Smyth, Heikki Mannila: \"Principles of Data Mining\", The MIT Press 2001. Uzupełniająca lista lektur Brak zaleceń",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   Eksploracyjna analiza danych. Budowa drzew decyzyjnych. Segmentacja zbiorów danych.",
        "plik": "372967.pdf"
    },
    {
        "nazwa_przedmiotu": "Human-computer interaction,",
        "kod_przedmiotu": "PG_00045305",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "• zapoznanie studentów z zasadami budowy efektywnej komunikacji człowiek-komputer • nabycie umiejętności projektowania, oceny i doskonalenia właściwości ergonomicznych interfejsu użytkownika • nabycie praktycznej umiejętności prowadzenia testów użyteczności i organizowania współpracy z użytkownikami podczas realizacji projektu informatycznego",
        "efekty_uczenia_sie": "[K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym Student zna metody organizowania współpracy między dostawcą a klientem (użytkownikami) w projekcie IT. [SW1] Ocena wiedzy faktograficznej [K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student wykorzystuje technologie informatyczne do projektowania interakcji człowiek-komputer, usprawniając pozyskiwanie, analizę i przetwarzanie danych w kontekście użytkownika w aplikacjach biznesowych [SU2] Ocena umiejętności analizy informacji [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student klasyfikuje pozyskiwane informacje dotyczące zasad projektowania interakcji i metod budowy interfejsu użytkownika, oceniając ich przydatność do rozwiązania problemów związanych z projektowaniem efektywnych interakcji w systemach interfejsu człowiek- komputer [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 13.02.2025 13:32 Strona 2 z 2",
        "tresc_przedmiotu": "1. Ergonomia, użyteczność i User Experience. 2. Charakterystyki użytkownika. 3. Interfejs GUI wytyczne i zasady projektowania, metody realizacji. 4. Interfejs WWW wytyczne i zasady projektowania, metody realizacji. 5. Podejście UCD zarządzanie jakością, metodyka User-Centred Design. 6. Podejście UCD - metody określania wymagań, analiza kontekstu użytkowania. 7. Podejście UCD - budowa prototypów, ocena i testy użyteczności. 8. Podejście UCD - pozyskiwanie danych od użytkowników badania ankietowe. 9. Podejście UCD - raporty i opracowania z badań użyteczności. 10. Metody współpracy z klientem w metodykach zwinnych. 11. Interfejsy multimodalne i naturalne. 12. Budowa interakcji ekonomicznych. Zaufanie on-line w e-biznesie i e-usługach. 13. Kreatywność i innowacje w projektowaniu interakcji on-line klient-usługodawca.",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Literatura podstawowa: Sharp H., Rogers Y., Preece J.: Interaction Design. Beyond Human- Computer Interaction. Wiley, 2011. Sikorski M. (2011). User-System Interaction Design in IT Projects.Politechnika Gdańska, Gdańsk, 2011 Uzupełniająca lista lektur Schneiderman B., et al. (2017). Designing the User Interface: Strategies for Effective Human-Computer Interaction. Pearson",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania - techniki realizacji dialogu użytkownik-system - zastosowanie prototypowania w budowie interfejsu użytkownika - metody współpracy z użytkownikami podczas realizacji projektu informatycznego",
        "plik": "372968.pdf"
    },
    {
        "nazwa_przedmiotu": "Basics of physics,",
        "kod_przedmiotu": "PG_00045292",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Fizyki Technicznej i Matematyki Stosowanej -> Katedra Fizyki Atomowej, Molekularnej i Optycznej",
        "cel_przedmiotu": "Wyposażenie studenta w specjalistyczną wiedzę dotyczącą podstawowych praw fizyki, wspomagającą przedmioty techniczne.",
        "efekty_uczenia_sie": "[K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Student jako przyszły inżynier pogłębia umiejętność krytycznego myślenia, tzw. rozumowania ilościowego oraz kreatywność. [SU1] Ocena realizacji zadania [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student wymienia i objaśnia podstawowe zjawiska, pojęcia, zależności i prawa dotyczące mechaniki klasycznej, mechaniki płynów, termodynamiki, ruchu drgającego i falowego, optyki geometrycznej i falowej oraz mechaniki relatywistycznej [SW1] Ocena wiedzy faktograficznej [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student rozwiązuje zadania dotyczące mechaniki klasycznej, termodynamiki, ruchu harmonicznego i falowego oraz falowej natury światła. [SU1] Ocena realizacji zadania  Data wygenerowania: 12.02.2025 10:11 Strona 2 z 3",
        "tresc_przedmiotu": "WYKŁAD  1. Układ SI; wektory. 2. Kinematyka i dynamika punktu materialnego. Zasady zachowania energii, pędu i momentu pędu. Podstawowe własności pola grawitacyjnego. Elementy mechaniki płynów. 3. Ciepło, praca, energia wewnętrzna, przemiany gazowe. Elementy kinetycznej teorii gazów. Entropia, procesy odwracalne i nieodwracalne. Zasady termodynamiki. 4. Oscylator harmoniczny, składanie drgań. Fale mechaniczne. Fale poprzeczne i podłużne. Gęstość energii fali 5. Elementy optyki geometrycznej. Optyka falowa: interferencja dyfrakcja i polaryzacja fal. 6. Postulaty Einsteina. Transformacja Lorentza i jej konsekwencje.  ĆWICZENIA AUDYTORYJNE 1. Zadania z kinematyki ruchu postępowego, opis ruchu w kartezjańskim układzie odniesienia. Prędkość, przyspieszenie, przyspieszenie styczne i normalne. Zadania z kinematyki ruchu obrotowego. Zadania z dynamiki ruchu postępowego, zastosowanie zasad dynamiki Newtona. Zadania związane z wykorzystaniem zasad zachowania energii i pędu. 2. Zadania ilustrujące I zasadę termodynamiki dla modelu gazu doskonałego. 3. Przykłady ruchu harmonicznego. Podstawowe parametry ruchu falowego. 4. Zadania dotyczące interferencji światła. Dyfrakcja światła na pojedynczej szczelinie.",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur University Physics, Openstax  Halliday D., Resnick R., Walker J., Fundamentals of physics Uzupełniająca lista lektur Shankar R., Fundamentals of Physics: Mechanics, Relativity, and Thermodynamics  Brown R. G., Introductory Physics I: Elementary Mechanics Orear J., Physics",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Zachowanie energii, pędu i momentu pędu w układach ciał.  Prosty ruch harmoniczny. Gęstość energii fali podłużnej. Astronauta twierdzi, że rakieta, którą leci, ma długość 100m (chodzi o długość mierzoną w kierunku ruchu). Jaką długość będzie miała ta rakieta dla obserwatora, od którego rakieta oddala się prędkością 0,6c? A) 100m         B) 80m        C) 60m      D) 40m Natężenie światła pochodzącego ze źródła takiego jak świeca czy żarówka, po przejściu przez polaryzator A) nie zmienia się     B) maleje dwukrotnie     C) maleje czterokrotnie    D) maleje do zera Z działa znajdującego się 45 m nad ziemią wystrzelony został poziomo pocisk, jego prędkość względem działa wynosi 250 m/s. Jak długo pocisk pozostanie w powietrzu? W jakiej odległości liczonej poziomo od punktu startu pocisk uderzy w ziemię? Jaka będzie pionowa składowa prędkości w chwili uderzenia w ziemię?",
        "plik": "372970.pdf"
    },
    {
        "nazwa_przedmiotu": "Communication and negotiations,",
        "kod_przedmiotu": "PG_00045328",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Przedsiębiorczości",
        "cel_przedmiotu": "Celem przedmiotu jest przygotowanie studentów do efektywnego komunikowania się w procesie pracy zespołowej oraz udziału w negocjacjach z wewnętrznymi i zewnętrznymi klientami projektu.",
        "efekty_uczenia_sie": "[K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych podejmuje w negocjacjach kompetentne i etyczne decyzje zapewniając dbałość o interes publiczny [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją negocjuje skutecznie ze zróżnicowanymi grupami odbiorców przedstawiając przekonujące argumenty i ich pogłębioną interpretację [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U03] wykazuje się profesjonalnym i efektywnym działaniem w ramach pracy zespołowej, zarówno w roli lidera, jak i członka zespołu analizuje sytuacje biznesowe pod kątem możliwości zastosowania negocjacji lub mediacji, prawidłowo przeprowadzając proces przygotowania i wdrażając, samodzielnie i w zespole, zasady efektywnych negocjacji i mediacji [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu  Data wygenerowania: 11.03.2025 18:19 Strona 2 z 2",
        "tresc_przedmiotu": "• Wprowadzenie - proces komunikacji interpersonanej • Komunikacja werbalna i niewerbalna • Style komunikacji międzyludzkiej • Charakterystyka pracy zespołowej, podejmowanie decyzji w zespole • Komunikacja jako narzędzie budowania klimatu pracy zespołowej • Role w zespole • bariery w komunikowaniu się zespołów • Komunikacja w zespole zróżnicowanym, wirtualnym • Prezentacja jako forma komunikacji • Alternatywne metody rozwiązywania konfliktów (ADR) • Proces negocjacji, typy i style negocjacji • Przygotowanie, techniki i ocena negocjacji",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Cialdini, R. (2006), Influence: The Psychology of Persuasion, Revised Edition Harper  Fisher, R., Ury, W.L. (2011) Getting to Yes: Negotiating Agreement Without Giving In.  Penguin Books. Kahneman, D.(2013) Thinking, fast and slow. Farrar, Straus and Giroux Voss, Ch. (2016) Never Split the Difference: Negotiating As If Your Life Depended On It. Harper Business. Uzupełniająca lista lektur Malhotra, D., Bazerman, M. (2008), Negotiation Genius: How to Overcome Obstacles and Achieve Brilliant Results at the Bargaining Table and Beyond. Bantam; NO-VALUE edition",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Wraz z zespołem przeprowadźcie ankietę dotyczącą najczęściej popełnianych w komunikacji błędów i zaprezentujcie wyniki w czasie kolejnych zajęć.  Opisz i oceń metody rozwiązania konfliktów w zespole na wybranym przykładzie (rzeczywistym i aktualnym).",
        "plik": "372971.pdf"
    },
    {
        "nazwa_przedmiotu": "Essentials of management,",
        "kod_przedmiotu": "PG_00045289",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Zarządzania",
        "cel_przedmiotu": "Uzyskanie wiedzy na temat podstaw zarządzania organizacjami i nabycie umiejętności wykorzystania jej w praktyce oraz pracy w międzynarodowym zespole.",
        "efekty_uczenia_sie": "[K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami student posiada umiejętnosc identyfikacji procesów zarządzczych oraz doboru metod wspierających te procesy. [SW1] Ocena wiedzy faktograficznej [K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne student posiada wiedzę i doświadczenie w analize procesów w organizacjach oraz zna metedoy które mogą w tym pomóc [SU1] Ocena realizacji zadania [K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych student posiada wiedzę dotyczącą metod rozwoju organizacji [SK1] Ocena umiejętności pracy w grupie",
        "tresc_przedmiotu": "1. Wprowadzenie zarządzanie i kierownicyPlanowanie natura i celCele, strategiepolityki, podejmowanie decyzjiOrganizowanie natura organizacjiStruktura organizacyjna,Delegowanie i decentralizacjaOrganizacjaMotywacja/przewodnictwo czynniki ludzkie i motywacjaKontrolowanie system i proces kontrolowaniaEwolucja zarządzania (Taylor, Fayol)",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur Griffin R. W. , Management, Houghton Mifflin Company.  Stoner J.A.F. , R.E. Freeman, Management, Prentice-Hall International Edition. Weihrich H., Management a global perspective, McGraw-Hill Inc. Hodgetts R. M., Luthans F., International Management, McGraw-Hill Inc.  Stephen P. Robbins, Mary A. Coulter, David A. De Cenzo, Fundamentals of Management, Global Edition 11th Edition, 2020.  Uzupełniająca lista lektur R. Griffin, Podstawy zarządzania organizacjami, PWN, Warszawa 2001;  S. Robbins, D. DeCenso, Podstawy zarządzania, PWE, Warszawa 2002; P. Drucker, Praktyka zarządzania, MT Biznes, Warszawa 2005;",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Centralization, describe + one example of centralization. 2. What is BCG matrix used for?",
        "plik": "372972.pdf"
    },
    {
        "nazwa_przedmiotu": "Descriptive statistics,",
        "kod_przedmiotu": "PG_00045293",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Statystyki i Ekonometrii",
        "cel_przedmiotu": "Zdobycie umiejętności statystycznej analizy danych w próbie przy wykorzystaniu języka programowania Python.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student wykorzystuje język Python w celu opracowania profesjonalnego raportu EDA (exploratory data analysis) dla zadanego zbioru danych w kontekście np. biznesowym. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU2] Ocena umiejętności analizy informacji [SU1] Ocena realizacji zadania [K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student potrafi przeprowadzać zaawansowaną analizę danych, wykorzystując odpowiednie miary statystyczne (np. średnia, mediana, wariancja, współczynnik skośności, kurtoza) oraz techniki eksploracji danych, takie jak analiza rozkładu i korelacji, przy użyciu Pythona. Student potrafi efektywnie prezentować wyniki analizy za pomocą odpowiednich wykresów (np. histogramów, wykresów pudełkowych) i tabel w Pythonie, wykorzystując biblioteki takie jak Matplotlib i Seaborn, umożliwiając lepszą interpretację wyników. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU2] Ocena umiejętności analizy informacji [SU1] Ocena realizacji zadania [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student posiada zaawansowaną wiedzę na temat metod statystyki opisowej, takich jak miary tendencji centralnej (średnia, mediana, tryb), miary zmienności (wariancja, odchylenie standardowe), miary kształtu rozkładu (skośność, kurtoza), a także technik wykrywania wartości odstających. Student zna i rozumie zaawansowane narzędzia oraz biblioteki Pythona (takie jak NumPy, Pandas, Matplotlib, Seaborn, SciPy) wykorzystywane w analizie statystycznej, rozwiązywaniu problemów oraz wizualizacji danych. Student ma zaawansowaną wiedzę na temat technik eksploracji danych, w tym analizy rozkładów, analizy korelacji między zmiennymi oraz identyfikacji i interpretacji wartości odstających. Student rozumie pełen cykl analizy danych – od wstępnego oczyszczania danych, przez eksplorację, po interpretację wyników i formułowanie wniosków, oraz zna metody weryfikacji poprawności przeprowadzonych analiz. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 13.02.2025 13:00 Strona 3 z 4",
        "tresc_przedmiotu": "0. Wprowadzenie do języka Python. Podstawowe operacje w Pythonie.  CZĘŚĆ 1 - ANALIZA  STRUKTURY 1.Podstawowe pojęcia (statystyka, zbiorowość statystyczna, cecha), badanie statystyczne etapy, prezentacja graficzna i tabelaryczna rozkładu cechy rodzaje tabel i wykresów statystycznych, przykłady. 2.Empiryczny rozkład cechy. Szeregi strukturalne i rozdzielcze (punktowe i przedziałowe), ustalanie liczby klas. 3.Miary położenia klasyczne i pozycyjne. Średnia, dominanta, mediana, kwantyle. Sposoby liczenia, przykłady. 4.Miary zmienności (dyspersji) klasyczne i pozycyjne. Wariancja, odchylenie standardowe, współczynnik zmienności, rozstęp, odchylenie ćwiartkowe. Sposoby liczenia, przykłady. 5.Miary asymetrii i koncentracji. Rodzaje rozkładów, krzywa Lorenza, współczynnik Giniego. Sposoby liczenia, przykłady. Porównywanie rozkładów względny wskaźnik podobieństwa struktur. CZĘŚĆ 2 ANALIZA KORELACJI I REGRESJI 1.Analiza korelacji dla cech ilościowych. Pojęcie korelacji, statystyczna prezentacja korelacji, związki korelacyjne, miary korelacji, współczynnik korelacji liniowej Pearsona. 2.Wprowadzenie do wnioskowania statystycznego (rodzaje hipotez, poziom istotności, prawdopodobieństwo testowe) . Analiza korelacji dla cech jakościowych. Test zgodności Pearsona, poprawka Yatesa, współczynnik Yula, współczynniki zbieżności korelacyjnej T Czuprowa, V Cramera, C Pearsona. 3.Korelacja cząstkowa i wieloraka. Współczynniki korelacji rang Spearmana, Kendalla 4.Podstawy analizy regresji. Regresja liniowa, klasyczna metoda najmniejszych kwadratów, współczynnik determinacji i zbieżności, indeks korelacji, interpretacja siły i kierunku oddziaływania zmiennych. 5.Regresja wieloraka i nieliniowa. Zmienna zależna i zmienne niezależne, transformacje nieliniowych funkcji regresji potęgowa, wykładnicza, hiperboliczna, wielomiany, interpretacje. CZĘŚĆ 3 ANALIZA DYNAMIKI 1.Szereg czasowy. Indeksy dynamiki -  łańcuchowe i jednopodstawowe, transformacje, średnie tempo zmian, interpretacja, sposoby liczenia, przykłady. 2.Zastosowanie indeksów dynamiki analiza zmian, urealnianie, prognozowanie krótkookresowe. 3.Modele trendu dekompozycja szeregu czasowego, analiza wahań sezonowych, liniowe i nieliniowe modele trendu, interpretacja, przykłady.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Matematyka, język angielski (poziom średniozaawansowany), podstawowe umiejętności programistyczne - Python.",
        "lista_lektur": "Podstawowa lista lektur   1. Grus, J. (2019). Data science from scratch: First principles with Python (2nd ed.). O'Reilly Media. 2. VanderPlas, J. (2022). Python data science handbook: Essential tools for working with data (2nd ed.). O'Reilly Media. 3. McKinney, W. (2017). Python for data analysis: Data wrangling with pandas, numpy, and ipython (2nd ed.). O'Reilly Media.   Uzupełniająca lista lektur 1. O'Reilly, T. (2019). Learning pandas: Getting started with data analysis and visualization in Python. O'Reilly Media. 2. Beyer, H., & Laubacher, R. (2021). Data science for business and decision making: A hands-on guide to data science and machine learning with Python. Packt Publishing. 3. Downey, A. B. (2017). Think stats: Exploratory data analysis in Python (2nd ed.). O'Reilly Media.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Przeprowadź analizę EDA na zadanym zbiorze danych. Oblicz miary tendencji centralnej (średnia, mediana, tryb), miary zmienności (wariancja, odchylenie standardowe), oraz przedstaw rozkład danych za pomocą odpowiednich wykresów (np. histogram, wykres pudełkowy). 2. Wyjaśnij miary rozkładu, takie jak skośność i kurtoza. Jakich informacji dostarczają te miary o danych? 3. Z użyciem Pythona i bibliotek Pandas oraz Matplotlib, wykonaj analizę danych z pliku CSV zawierającego dane o sprzedaży w sklepie internetowym. Stwórz wykresy, które pomogą zwizualizować zależności między poszczególnymi zmiennymi (np. sprzedaż a dzień tygodnia). 4. Jakie techniki wykrywania wartości odstających w danych opisujesz w kontekście statystyki opisowej? Zastosuj jedną z metod do wykrycia wartości odstających w zadanym zbiorze danych przy użyciu Pythona. 5. Przeprowadź analizę korelacji między dwoma zmiennymi w zadanym zbiorze danych. Wyjaśnij, co oznacza wynik korelacji, i omów, jak może to wpłynąć na interpretację danych oraz podejmowanie decyzji w kontekście biznesowym.",
        "plik": "372973.pdf"
    },
    {
        "nazwa_przedmiotu": "Numerical methods,",
        "kod_przedmiotu": "PG_00045296",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Mikrofalowej i Antenowej",
        "cel_przedmiotu": "Celem przedmiotu jest nauczenie studenta praktycznego stosowania podstawowych metod analizy numerycznej oraz zasad implementacji algorytmów numerycznych w językach programowania wysokiego poziomu.",
        "efekty_uczenia_sie": "[K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Studentka/student potrafi dokonać krytycznej analizy i oceny istniejących rozwiązań technicznych, korzystając zarówno z wiedzy teoretycznej zdobytej na wykładzie, jak i wiedzy praktycznej zdobytej w ramach zajęć laboratoryjnych. [SW2] Ocena wiedzy zawartej w prezentacji [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Studentka/student rozwiązuje problemy inżynierskie stosując metody numeryczne, które są adekwatne do złożoności problemu. Potrafi ocenić złożoność obliczeniową stosowanych metod oraz identyfikować źródła ewentualnych błędów numerycznych. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [SK2] Ocena postępów pracy [SK3] Ocena umiejętności organizacji pracy [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Studentka/student zna i rozumie podstawy analizy numerycznej, służącej do rozwiązywania problemów inżynierskich. Bazując na tej wiedzy, jest w stanie zrozumieć i zaimplementować bardziej złożone algorytmy, związane ze specyficznymi zastosowaniami. [SU1] Ocena realizacji zadania [SU2] Ocena umiejętności analizy informacji [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania  Data wygenerowania: 12.02.2025 10:07 Strona 2 z 2",
        "tresc_przedmiotu": "1 Rozwiązywanie układów równań liniowych  2 Rozwiązywanie równań nieliniowych 3 Błędy numeryczne 4 Interpolacja 5 Aproksymacja 6 Całkowanie numeryczne",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Uczestnicy kursu powinni rozumieć zagadnienia z analizy matematycznej i algebry oraz podstaw programowania.",
        "lista_lektur": "Podstawowa lista lektur [1] Fortuna, Zenon, Bohdan Macukow, and Janusz Wa¸ sowski. Metody numeryczne. Wydawnictwa Naukowo- Techniczene, 2002.  [2] Trefethen, Lloyd N., and David Bau III. Numerical linear algebra. Vol. 50. Siam, 1997.  Uzupełniająca lista lektur [1] Solomon, Justin. Numerical Algorithms,  AK Peters/CRC Press, 2015  https://people.csail.mit.edu/jsolomon/share/book/numerical_book.pdf",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "372974.pdf"
    },
    {
        "nazwa_przedmiotu": "Elements of discrete mathematics,",
        "kod_przedmiotu": "PG_00045294",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Algorytmów i Modelowania Systemów",
        "cel_przedmiotu": "Nabycie umiejętności posługiwania się formalnym językiem matematycznym.  Przyswojenie zdolności wyrażania relacji, zależności, konfiguracji w ścisłej formie. Zrozumienie istoty wnioskowania oraz konstrukcji dowodów. Poznanie i zastosowanie metod i narzędzi, w tym algorytmów grafowych, do rozwiązania rozmaitych problemów teoretycznych i praktycznych, które można modelować narzędziami matematyki dyskretnej.",
        "efekty_uczenia_sie": "[K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student definiuje, opisuje, analizuje, wyjaśnia i stosuje zaawansowane metody matematyki dyskretnej, w szczególności algorytmy grafowe, w różnorodnych zastosowaniach stosując język matematyczny. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW1] Ocena wiedzy faktograficznej [SW2] Ocena wiedzy zawartej w prezentacji [K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student ocenia przydatność poznanych algorytmów, metod i narzędzi klasyfikując je pod kątem ich zastosowania w praktyce, a także analizuje i selekcjonuje informacje z różnych źródeł. [SW1] Ocena wiedzy faktograficznej [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW2] Ocena wiedzy zawartej w prezentacji [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student formułuje, opracowuje i analizuje strategie rozwiązania złożonych problemów wykorzystujących narzędzia matematyki dyskretnej. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania",
        "tresc_przedmiotu": "Logika matematyczna - powtórzenie. Algebra zbiorów. Rachunek zdań. Rachunek predykatów. Indukcja matematyczna. Relacje binarne: relacje równoważności, porządki. Elementy zliczania i kombinatoryki. Teoria grafów - notacja, pojęcia podstawowe, grafy eulerowskie i ich zastosowania, problem chińskiego listonosza, grafy hamiltonowskie, problem komiwojażera, własności drzew, planarność, pojęcie dominowania w grafach. Kolorowanie grafów. Algorytm Dijkstry, algorytm znajdowania minimalnego drzewa spinającego.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Podstawowe umiejętności matematyczne.",
        "lista_lektur": "Podstawowa lista lektur K. A. Ross, C. R. B. Wright, Matematyka dyskretna, PWN, Warszawa 1996. R. L. Graham, D. E. Knuth, O. Patashnik, Matematyka konkretna, PWN, Warszawa 1996. Uzupełniająca lista lektur W. Lipski, W. Marek, Analiza kombinatoryczna, PWN, Warszawa 1986. H. Rasiowa, Wstęp do matematyki współczesnej, PWN, Warszawa 1984. R. J. Wilson, Wprowadzenie do teorii grafów, PWN, Warszawa 2000.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Draw the Hasse diagram for the poset: ({1,2,4,6,8},|).  Does there exist a graph with 5 vertices, every vertex incident with at least one edge but no two edges adjacent? Explain. Acquaintance with a previously unknown definition of a graph theory parameter and the resolution of related problems. Application of discrete mathematics methods and tools in solving puzzles and brainteasers.",
        "plik": "372975.pdf"
    },
    {
        "nazwa_przedmiotu": "Algorithms and data structures,",
        "kod_przedmiotu": "PG_00045360",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Algorytmów i Modelowania Systemów",
        "cel_przedmiotu": "Celem przedmiotu jest wprowadzenie słuchacza w zagadnienie algorytmów i struktur danych. Prezentowane są podstawowe i zaawansowane struktury danych oraz podstawowe algorytmy z wybranych dziedzin. W ramach wykładu prezentowane są podstawowe zagadnienia związane z konstrukcją algorytmów.",
        "efekty_uczenia_sie": "[K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Słuchacz potrafi analizować problemy i dobierać właściwe modele danych oraz struktury danych dla różnych zagadnień. [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Słuchacz zna podstawowe struktury danych i odpowiadające im algorytmy, Słuchacz potrafi dobierać algorytmy dla potrzeb rozwiązywanych problemów [SU1] Ocena realizacji zadania [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Słuchacz zna podstawowe pojęcia odnośnie algorytmów i struktur danych. Słychacz wie jak działają podstawowe struktury danych i wybrane algorytmy. Słuchacz potrafi wybrać algorytm dla problemu np. uwzględniając uwarunkowania czasowe lub pamięciowe. [SW1] Ocena wiedzy faktograficznej",
        "tresc_przedmiotu": "Pojecie algorytmu, różnice miedzy algorytmami, wpływ modelu na rozwiązanie, reprezentacja algorytmów, analiza poprawności  Ocena tempa wzrostu, notacja o, czas vs. złożoność, Przykłady rozwiązań rekurencyjnych i iteracyjnych, metody wyczerpujące, heurystyczne, programowanie dynamiczne Przykłady rekurencyjnych rozwiązań typu dziel i rozwiązuj. Podstawowe struktury danych: lista, kolejka, stos i metody ich implementacji Podstawowe algorytmy sortowania, poszukiwanie binarne, sortowanie szybkie, kopcowe. statystyki pozycyjne, Tablice haszowane Drzewa wyszukiwawcze, równoważenie drzew, Drzewa czerwono-czarne, BDrzewa, kopca złączalne. Reprezentacja grafów. Podstawowe algorytmy grafowe drzewa spinające:alg.Prima and Kruskala, cykl eulera, minimalna droga: Dijkstra",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Kurs podstaw programowania",
        "lista_lektur": "Podstawowa lista lektur T. Cormen,Wprowadzenie do algorytmow, WNT 2001 Uzupełniająca lista lektur http://www.algorytm.org/",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania LAB: implementacja algorytmów rekurencyjnych i iteracyjnych, implementacja prostych metod sortowania, tablic haszowanych, rozwiązania problemu plecakowego  PROJ:  Implementacja kalkulatora ONP dla operacji na napisach, implementacja MiniMax dla prostej gry",
        "plik": "372976.pdf"
    },
    {
        "nazwa_przedmiotu": "Essentials of micro- and macroeconomics,",
        "kod_przedmiotu": "PG_00045359",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów z podstawami mikro- i makroekonomii oraz praktycznymi aspektami problematyki funkcjonowania współczesnej gospodarki rynkowej.",
        "efekty_uczenia_sie": "[K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Studenci potrafią podejmować świadome i odpowiedzialne decyzje ekonomiczne w zarządzaniu przedsiębiorstwem, ukierunkowane na tworzenie i utrzymanie wartości ekonomicznych, społecznych i środowiskowych. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Studenci potrafią analizować funkcjonowanie rynków i systemów gospodarczych oraz dobierać metody rozwiązania problemów, uwzględniając relacje między procesami. [SW1] Ocena wiedzy faktograficznej [K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne Studenci potrafią analizować dane ekonomiczne i procesy w przedsiębiorstwach, wykorzystując metody analityczne i symulacyjne do ich doskonalenia. [SU1] Ocena realizacji zadania [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji  Data wygenerowania: 06.03.2025 20:31 Strona 2 z 3",
        "tresc_przedmiotu": "Introduction to Economics Ten Principles  Economic Way of Thinking Market in Action S-D Model of Market Elasticity and Its Application Price Controls, Consumer and Producer Surplus Theory of Costs Perfect Competition Pure Monopoly Oligopoly Gross Domestic Product Unemployment Inflation Government Budget Money Banking System",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 45.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 75.0",
        "wymagania_wstepne": " Posiadanie wiedzy ogólnej na poziomie absolwenta szkoły średniej.",
        "lista_lektur": "Podstawowa lista lektur N. Gregory Mankiw, Principles of Economics - 8th edition, Cengage Learning  Taylor, John B., Weerapana, Akila, Principles of Microeconomics 6th edition Cengage Learning Uzupełniająca lista lektur Harford T., Undercover Economist, Oxford University Press",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Market failures include . and . The concept of invisible hand of the market was developed by  1)        Which of the following does NOT add to U.S. GDP? a)        General Motors builds a new auto factory in North Carolina. b)        Air France buys a plane from Boeing, the U.S. aircraft manufacturer. c)        The federal government sends a Social Security check to your grandmother. d)        The city of New York pays a salary to a policeman. 1)        The city government is considering a following tax proposal - a tax of $1 per-hot-dog, paid by producers of hot-dogs. Which curves would shift as a result of this tax? a)        AVC, ATC, MC b)        AVC, ATC c)        AFC, ATC d)        AFC, ATC, MC",
        "plik": "372977.pdf"
    },
    {
        "nazwa_przedmiotu": "Object programming,",
        "kod_przedmiotu": "PG_00045295",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "2",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Systemów Geoinformatycznych",
        "cel_przedmiotu": "Nabycie wiedzy z zakresu teorii programowania obiektowego oraz umiejętności programowania z wykorzystaniem tego typu podejścia.",
        "efekty_uczenia_sie": "[K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student zdobywa umiejętności praktyczne wykonując przykładowe zadania w kilku językach programowania obiektowego. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student potrafi zaprezentować rozwiązania stosowane w zrealizowanych przez siebie zadaniach. [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Student nabywa umiejętności z zakresu podstaw programowania obiektowego z wykorzystaniem następujących języków programowania: C++, Java, C#, Python i Javascript. [SU2] Ocena umiejętności analizy informacji [SU1] Ocena realizacji zadania  Data wygenerowania: 14.02.2025 11:24 Strona 2 z 2",
        "tresc_przedmiotu": "1. Paradygmaty programowania ze szczególnym uwzględnieniem paradygmatu obiektowego 2. Implementacja enkapsulacji, dziedziczenia, abstrakcji i polimorfizmu w języku C++ 3. Specyfika implementacji obiektowości w języku C++ 4. Język Java i jego porównanie z językiem C++ 5. Język C# i jako następca języka C i porównanie z językiem Java 6. Język Python jako przedstawiciel skryptowych języków programowania obiektowego",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 11.0 Projekt: 30.0 Seminarium: 0.0 RAZEM: 56.0",
        "wymagania_wstepne": " Znajomość dowolnego języka programowania nieobiektowego np języka C",
        "lista_lektur": "Podstawowa lista lektur Bjarne Strastroup - The C++ programming language  Bruce Eckel - Thinking in Java Andy Harris -  Macrosoft C# for absolute beginner Mark Lutz - Programming Python Uzupełniająca lista lektur John Hunt - Smalltalk and Object Orientation",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Przykładowe pytanie: w jakim kierunku rozwija się język C++?  Przykładowe zadanie: Implementacja prostego programu obiektowego z zastosowaniem paradygmatów programowania obiektowego w róznych językach programowania.",
        "plik": "372978.pdf"
    },
    {
        "nazwa_przedmiotu": "Operating systems,",
        "kod_przedmiotu": "PG_00045291",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów z podstawami budowy systemów operacyjnych, w tym z zarządzanie systemem plików, procesami i sprzętem komputerowym. Przedstawienie podstawowych poleceń i struktur języki powłoki.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student zna i potrafi korzystać z programów do przetwarzania tekstu. Jest w stanie zaprojektować, zaimplementować i przetestować skrypty powłoki [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student potrafi administrować zasobami systemów Linux i Windows. Rozumie politykę dostępu do zasobów systemowych. [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student zna podstawowe architektury systemów komputerowych. Rozumie koncepcję procesów, systemów plików, zarządzaniem pamięcią oraz szeregowania zadań. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 09:56 Strona 2 z 2",
        "tresc_przedmiotu": "1. Pojęcie systemu operacyjnego, definicje i modele 2. Koncepcja budowy systemu operacyjnego i model strukturalny 3. Pojęcie pliku i jego części składowe 4. System plików, struktura drzewa katalogów 5. Model i implementacja procesu, funkcja fork 6. Standardowe urządzania we-wy, przekierowanie, funkcja pipe 7. Zarządzanie procesami i wątkami 8. Przełączanie kontekstu, współbieżność 9. Szeregowanie zadań, kolejkowanie, wywłaszczanie 10. Zarządzanie dyskami i pamięcią RAM 11. Stronicowanie na żądanie 12. Bezpieczeństwo zasobów, mechanizmy ochrony 13. Właściwości i zadania powłoki shell 14. Podstawowe polecenia powłoki 15. Programy do przetwarzania tekstów 16. Programowanie w języku powłoki, rola skryptów 17. Zasady pisania skryptów, kontrola parametrów 18. Zasady instalacji i konfiguracja systemu 19. Cechy systemu Linux i rodzaje dystrybucji",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur 1. Abraham Silberschatz, Peter B. Galvin, Greg Gagne: Silberschatz's Operating System Concepts, Wiley, 2019, 2. Richard Blum, Christine Bresnahan: Linux Command Line and Shell Scripting Bible, Wiley, 2021  Uzupełniająca lista lektur   1. Nemeth E. ed. : Przewodnik administratora systemu UNIX, Helion, 2023 2. Kaczmarek J.: Szkoła systemu Linux, Helion, 2007.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   • Administracja system Linux • Tworzenie skryptów w języku powłoki • Szeregowanie zadań • Zarządzanie pamięcią",
        "plik": "372979.pdf"
    },
    {
        "nazwa_przedmiotu": "Linear algebra,",
        "kod_przedmiotu": "PG_00045352",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki",
        "cel_przedmiotu": "Uzyskanie przez studenta kompetencji w posługiwaniu się aparatem algebry liniowej do rozwiązywania prostych zagadnień występujących w dziedzinach inżynierskich, w szczególności w inżynierii danych.",
        "efekty_uczenia_sie": "[K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student potrafi dokonać analizy problemu a następnie wybrać spośród metod poznanych podczas zajęć narzędzia potrzebne do jego poprawnego rozwiązania. [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji [SU1] Ocena realizacji zadania [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student zna podstawowe twierdzenia, metody i narzędzia poznane podczas zajęć i wie, jak je wykorzystywać. [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 10:05 Strona 2 z 3",
        "tresc_przedmiotu": "• Działania binarne. Podstawowe struktury algebraiczne: grupa, pierścień, ciało, przestrzeń liniowa. • Elementy arytmetyki modularnej, tabelki działań dodawanie i mnożenia modulo n. Odwrotność modulo n. Ciało Zp. • Ciało liczb zespolonych. Liczby zespolone i ich intepretacja geometryczna. Działania na liczbach zespolonych. Pierwiastki liczb zespolonych. Rozwiązywanie prostych równań w dziedzinie zespolonej. • Pierścień wielomianów na ciałem K. Pierwiastki wielomianu. Twierdzenie zasadnicze algebry. Rozkład wielomianu na czynniki. Działania na wielomianach o współczynnikach z ciała K=Zp. Schemat Hornera. • Macierze, ich rodzaje, działania na macierzach. Macierz odwrotna, równania macierzowe. Wyznaczniki. • Układy równań liniowych. Twierdzenie Cramera. Metoda eliminacji Gaussa-Jordana, metoda kolumn jednostkowych. • Wektory w R3, iloczyn skalarny, wektorowy, mieszany. Zastosowania ioczynów. • Prosta i płaszczyzna w przestrzeni - równania ogólne, parametryczne, kanoniczne, krawędziowe.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur   • T.Jankowski, Linear algebra, Publishing House of Gdansk University of Technology, Gdańsk, 2001. • Elements of Linear Algebra, Moodle course (by M.Łapińska and M.Musielak) • J.Topp, Algebra, Publishing House of Gdansk University of Technology, Gdańsk, 2005. • eKurs z Rachunku Macierzowego: https://enauczanie.pg.edu.pl/ moodle/course/view.php?id=2388  Uzupełniająca lista lektur • K.Binmore, J.Davies, Calculus, Cambridge University Press, 2007. • T.Jurlewicz, Z.Skoczylas, Algebra i geometria analityczna, GiS, Wrocław 2008 • C.Meyer, Matrix analysis and applied linear algebra, SIAM 2005 • H. Anton, Calculus with analytic geometry, Wiley & Sons, 1989",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Rozwiąż równanie macierzowe AX=B, gdzie A i B są danymi macierzami. 2. Za pomocą wzorów Cramera wyznaczyć niewiadomą y z układu równań : x+2y+2z+3t=3, 3y+t=1, 5x-2y+t=1, 4x-5y+2t=1. 3. Wyznaczyć wszystkie pierwiastki równania z3 - 8i=0. Podać ich postać algebraiczną. 4. Wielomian W(z)=z3-iz2-2iz-2, którego jednym z pierwiastków jest z1=i rozłożyć na czynniki stopnia pierwszego. 5. Napisać równanie ogólne płaszczyzny przechodzącej przez punkt P=(1,-1,3) i równoległej do wektorów a = [1,1,0] i b=[0,1,1]. 6. Zbadać wzajemne położenie prostych l1 : x=1+t, y=-2-t, z=3+2t i l2: x=4+s, y=-2+2s, z=4-3s.",
        "plik": "372980.pdf"
    },
    {
        "nazwa_przedmiotu": "Basics of computer programming,",
        "kod_przedmiotu": "PG_00045290",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Algorytmów i Modelowania Systemów",
        "cel_przedmiotu": "Celem przedmiotu jest wprowadzenie do programowania komputerów, którego głównym celem jest nauczenie studenta rozwiązywania problemów programistycznych i pisania programów w języku C/C++.",
        "efekty_uczenia_sie": "[K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student programuje w języku programowania proceduralnego, uruchamia i testuje programy. [SU1] Ocena realizacji zadania [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student prezentuje utworzony przez siebie kod wraz z jego analizą. [SU1] Ocena realizacji zadania [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student zna i rozumie wybrane modele programowania i ewolucję związanych z nimi języków. Student poznaje jedną z platform programowania obiektowego. [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 10:06 Strona 2 z 2",
        "tresc_przedmiotu": "WYKŁADY Wprowadzenie. Języki programowania, alfabet, syntaktyka i semantyka. Translacja. Klasyfikacja typów. Typy całkowite i zmiennoprzecinkowe. Operatory i wyrażenia arytmetyczne. Wybrane standardowe funkcje matematyczne. Typ znakowy. Rzutowanie typów. Typ logiczny. Operatory i wyrażenia logiczne. Podstawy obsługi wejścia/wyjścia. Instrukcje warunkowe (if, switch) oraz wyrażenie warunkowe. Instrukcje iteracyjne (for, while, do-while). Iteracje zagnieżdżone. Definiowanie typów. Stałe. Typ wyliczeniowy. Tablice jednowymiarowe i wielowymiarowe. Napisy. Zakres ważności i czas życia zmiennych. Funkcje. Efekty uboczne. Przesyłanie parametrów funkcji. Typ wskaźnikowy. Arytmetyka wskaźników. Wskaźniki w komunikacji między funkcjami. Dynamiczna alokacja pamięci. Podstawowe dynamiczne struktury danych. Struktury (rekordy). Struktury danych wykorzystujące rekordy i ich zastosowania. Zastosowania dynamicznych struktur danych (stosy, kolejki). Formatowanie wejścia/wyjścia. Przetwarzanie plików. Zastosowania rekurencji (np. zasada dziel i zwyciężaj, zachłanność, programowanie dynamiczne).  LABORATORIUM Rozwiązywanie prostych zadań programistycznych w oparciu o wiedzę przekazaną na wykładzie na podstawie instrukcji laboratoryjnych. PROJEKT Samodzielne wykonanie zadań programistycznych. Student ma do dyspozycji konsultacje projektowe.",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 20.0 Seminarium: 0.0 RAZEM: 65.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur 1. Podstawy programowania - notatki do wykładu, 2013 (dostępne są na stronie WWW kursu).  2. Materiały przygotowujące do laboratorium z Podstaw programowania (opracowanie zespołowe, 2013) (dostępne są na stronie WWW kursu). 3. Grębosz Jerzy, Symfonia C++ Standard (tom 1 i 2), Wydanie 2000, Krakow 2008. Uzupełniająca lista lektur -",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Napisanie programu realizującego zadaną funkcjonalność.  Przeanalizowanie sposobu działania zadanego programu.",
        "plik": "372981.pdf"
    },
    {
        "nazwa_przedmiotu": "Economics and organization of enterprises,",
        "kod_przedmiotu": "PG_00045358",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Przedsiębiorczości",
        "cel_przedmiotu": "• Studenci otrzymują wiedzę niezbędną do rozwijania umiejętności refleksji oraz zrozumienia, projektowania i zarządzania podmiotami gospodarczymi. • Skupienie uwagi na makro cechach organizacji, takich jak ich struktura, technologia i środowisko, oraz procesy wewnętrzne, takie jak kultura organizacyjna, podejmowanie decyzji menedżerskich, innowacje.",
        "efekty_uczenia_sie": "[K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Wykorzystuje informacje i wiedzę pozyskane na zajęciach i w innych źródłach do analizy wybranego elementu z zakresu makroekonomicznego otoczenia biznesu. [SW2] Ocena wiedzy zawartej w prezentacji [K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne Wykonuje zadania z zakresu wskazanych przez nauczyciela narzędzi. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU2] Ocena umiejętności analizy informacji [SU1] Ocena realizacji zadania [K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Uwzględnia kwestie etyczne i wartości w projektowanym przedsięwzięciu, we współpracy z grupą zadaniową. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [SK1] Ocena umiejętności pracy w grupie  Data wygenerowania: 12.02.2025 12:33 Strona 2 z 2",
        "tresc_przedmiotu": "1. Wprowadzenie do organizacji kursu 2. Środowisko biznesowe i ekonomia biznesu 3. Ekonomia i świat biznesu 4. Organizacje biznesowe 5. Działanie konkurencyjnych rynków 6. Biznes w środowisku rynkowym 7. Popyt i konsument 8. Ekonomia behawioralna konsumenta 9. Alternatywne teorie firmy 10. Wprowadzenie do strategii biznesowej 11. Strategia wzrostu 12. Sektor małych firm 13. Rząd i firma 14. Globalizacja i biznes wielonarodowy 15. Makroekonomiczne otoczenie biznesu",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur • Economics for Business, 9th edition, Sloman, J., Garratt, D., Guest, J., Jones, E., Pearson 2023 • Artykuły wymagane przez nauczyciela  Uzupełniająca lista lektur • Internet, artykuły naukowe, strony internetowe firm i instytucji",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Wybierz konkretny kraj i zbadaj dwa sektory - jeden, w którym produkcja i zatrudnienie wzrosły w ciągu ostatnich 20 lat i jeden, w którym produkcja i zatrudnienie spadły w tym samym okresie. Wyjaśnij swoje wnioski.  2. Wyszukaj dwa przypadki dużych firm, które upadły. Przygotuj krótką prezentację opisującą podobieństwa i różnice między tymi przypadkami a Enronem.",
        "plik": "372982.pdf"
    },
    {
        "nazwa_przedmiotu": "Elements of logic and epistemology,",
        "kod_przedmiotu": "PG_00045329",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Filozofii i Metodologii Nauk",
        "cel_przedmiotu": "Celem przedmiotu jest wprowadzenie do zagadnień z zakresu epistemologii oraz logiki.",
        "efekty_uczenia_sie": "[K6_K01] wykazuje się świadomością kwestii prawnych, etycznych i różnorodności kulturowej, podejmując społecznie odpowiedzialne decyzje Osoba studiująca jest świadoma społecznego i etycznego wymiaru problematyki związanej z wiedzą i poznaniem. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Potrafi korzystać z narzędzi logicznych oraz rozwiązywać złożone problemy o abstrakcyjnym charakterze. [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 13:15 Strona 2 z 3",
        "tresc_przedmiotu": "1.Wprowadzenie do kursu. Wymagania i etykieta. Czym jest filozofia, czym jest logika, czym jest epistemologia? 2. Wprowadzenie do logiki. Podstawowe pojęcia logiki. 3. Rachunek zdań. Podstawowe funkcje logiczne. Tautologie. Dowód przez sprzeczność. Ćwiczenia. 4. Logiczne reguły wnioskowania. Paradoksy implikacji materialnych. Wprowadzenie do rachunku predykatów. 5. Ćwiczenia z rachunku predykatów. Relacje logiczne. Typowe błędy logiczne. 6. Stary spór epistemologiczny o źródło wiedzy. Racjonalizm Platona i empiryzm Arystotelesa. 7. Współczesny zwrot ku epistemologii. Racjonalizm Kartezjusza i Leibnitza. Brytyjski empiryzm Bacona i Locke'a. Narodziny współczesnej nauki. 8. Idealizm i realizm. A priori vs a posteriori w poznaniu i wiedzy. Odpowiedź Kanta na sceptycyzm Davida Hume'a. Krytyczny (transcendentalny) idealizm Kanta i nowatorskość jego podejścia. 9. Korespondencyjna teoria prawdy. Sceptycyzm i argumenty sceptyczne w epistemologii. Problem percepcji, argument z iluzji. Czy poznajemy świat zewnętrzny bezpośrednio w naszej świadomości/ reprezentacjach mentalnych? Semantyczna, pragmatyczna i koherentna teoria prawdy. 10. Współczesna epistemologia. Wiedza jako uzasadnione przekonanie. Źródła wiedzy: percepcja, pamięć, introspekcja, świadectwo. Wyzwanie Gettiera. Struktury uzasadnienia (fundacjonalizm, koherentyzm, infinityzm). Eksternalizm a internalizm. 11. Wprowadzenie do filozofii umysłu: główne kontrowersje. Dylemat psychofizyczny. Świadomość, qualia, superweniencja. Koncepcje znaturalizowanego umysłu i wpływ psychologii ewolucyjnej. Maszyna Turinga i chiński pokój Searle'a. Hilary Putnam i mózgi w naczyniu. 12. Zwrot językowy. Ludwig Wittgenstein: od badania świadomości do filozofii języka. Austin: działamy słowami! Esencja amerykańskiego neopragmatyzmu: Richard Rorty. 13. Filozofia nauki. Problem demarkacji. Neopozytywizm i zdania protokolarne. Problem indukcji. Twierdzenie Quine'a-Duhema w nauce. Falsyfikacjonizm Karla Poppera. Henri Poincaré i Kazimierz Ajdukiewicz o konwencjonalizmie. 14. Thomas Samuel Kuhn o rewolucji naukowej. Pojęcie paradygmatu. Klasyczna i nieklasyczna socjologia wiedzy. Studia nad nauką i technologią. Bruno Latour o technologii i agencji nie-ludzkiej. Wiedza ekspercka i laicka. 15. Podsumowanie i test końcowy.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Brak zaleceń",
        "lista_lektur": "Podstawowa lista lektur Plato. 1992. Republic, trans. G. M. A. Grube, C. D. C. Reeves. Hackett Publishing.  René Descartes. 2006. A Discourse on the Method of Correctly Conducting Ones Reason and Seeking Truth in the Sciences, trans. Ian Maclean. Oxford University Press. Immanuel Kant. 2004. Prolegomena to Any Future Metaphysics That Will Be Able to Come Forward as Science with Selections from the Critique of Pure Reason, trans. Gary Hatfield. Cambridge University Press. John  R.  Searle. 1980. Minds,  brains,  and programs. The Behavioral And Brain Sciences 3,  417-457. John. L. Austin. 1962. How to Do Things with Words. Oxford University Press. Karl Popper. 2002. The Logic of Scientific Discovery. Routledge. Uzupełniająca lista lektur Ernest Sosa, Jaegwon Kim, Jeremy Fantl, Matthew McGrath. 2008. Epistemology. An Anthology. Blackwell Publishing.  Patrick J. Hurley, Lori Watson. 2018. A Concise Introduction to Logic. Cengage Learning.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Czym jest aprioryzm.  2. Sprawdź czy dana formuła jest tautologią Klasycznego Rachunku Zdań. 3. Zbadaj czy z danych zdań wynika wniosek. 4. Omów spór internalizm-eksternalizm. 5. Czym jest korespondencyjna teoria prawdy.",
        "plik": "372983.pdf"
    },
    {
        "nazwa_przedmiotu": "Precalculus,",
        "kod_przedmiotu": "PG_00045351",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Prorektor ds. kształcenia -> Centrum Matematyki",
        "cel_przedmiotu": "Uzyskanie przez studenta kompetencji w posługiwaniu się aparatem matematyki elementarnej",
        "efekty_uczenia_sie": "[K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student zna podstawowe twierdzenia, metody i narzędzia poznane podczas zajęć i wie, jak je wykorzystywać. [SW1] Ocena wiedzy faktograficznej [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student potrafi dokonać analizy problemu a następnie wybrać spośród metod poznanych podczas zajęć narzędzia potrzebne do jego poprawnego rozwiązania. [SU2] Ocena umiejętności analizy informacji [SU1] Ocena realizacji zadania [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu",
        "tresc_przedmiotu": "• Przypomnienie wiadomości o funkcjach wielomianowych, wymiernych i potęgowych. • Funkcje wykładnicze. Równania i nierówności wykładnicze. Funkcja logarytmiczna jako odwrotna do wykładniczej. Logarytmy i ich własności. Równania i nierówności logarytmiczne. • Miara łukowa kąta. Funkcje trygonometryczne dowolnego kąta. Wykresy funkcji trygonometrycznych. Wzory i tożsamości trygonometryczne. Równania i nierówności trygonometryczne. Funkcje cyklometryczne. • Ciągi liczbowe. Monotoniczność, ograniczoność, granica ciągu. Własności ciągów zbieżnych. Twierdzenia o dwóch i trzech ciągach.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur • B.Sikora, E.Łobos, A first course in calculus, Wydawnictwo Politechniki Śląskiej, 2010 • K.Binmore, J.Davies, Clculus, Cambridge University Press, 2007 • Portal Mathematics, https://cnm.pg.edu.pl/mathematics/precalculus Uzupełniająca lista lektur • Matematyka. Podstawy z elementami matematyki wyższej, pod red. B.Wikieł, Wydawnictwo Politechniki Gdańskiej • K.Jankowska, T.Jankowski, Zbiór zadań z matematyki, Wydawnictwo PG, 2010 • W.Żakowski, Algebra i analiza matematyczna dla licealistów i kandydatów na wyższe uczelnie, WNT, Warszawa 1999 • M.Gewert, Z.Skoczylas, Analiza matematyczna 1, Oficyna wydawnicza GiS.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Rozwiązać nierówność ( x4+x2-10x) / (1-sin 2 x)<0. 2. Rozwiązać równanie 9log3sin x - 41/2+\\log2cos x - log2 0,5=0. 3. Znajdź dziedzinę, zbiór wartości i naszkicuj wykres funkcji f(x)=+1/2 arcsin(1-2x). Wyznacz funkcje odwrotną do f. 4. Oblicz tg(\\arccos(2/3)+cos(arctg(2/3). 5. Dany jest ciąg an=(3n)!/n3n . Obliczyć limn(an+1/an). 6. Korzystając z twierdzenia o trzech ciągach wyznacz granicę ciągu xn= 2/(n4+2)+4/(n4+4)+6/(n4+6)+... +2n/(n4+2n)",
        "plik": "372984.pdf"
    },
    {
        "nazwa_przedmiotu": "Hypertext and hypermedia,",
        "kod_przedmiotu": "PG_00045355",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inteligentnych Systemów Interaktywnych",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie z zagadnieniami dotyczącymi hipertekstu i hipermediów.",
        "efekty_uczenia_sie": "[K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student opisuje podstawowe zagadnienia dotyczące prezentacji, transformacji i synchronizacji informacji w systemie rozproszonym, opisuje współczesne technologie realizacji hipermediów i związanych z nimi usług oraz prezentuje własny system pozyskiwania i prezentacji informacji z wykorzystaniem wybranych technologii. [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU1] Ocena realizacji zadania [K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów Student umie zorganizować dostęp do usług wystawionych w sieci. Student prezentuje własny system pozyskiwania i prezentacji informacji z wykorzystaniem wybranych technologii. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student opisuje podstawowe zagadnienia dotyczące prezentacji, transformacji i synchronizacji informacji w systemie rozproszonym, opisuje współczesne technologie realizacji hipermediów i związanych z nimi usług [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 10:10 Strona 2 z 2",
        "tresc_przedmiotu": "1. Wprowadzenie do Internetu i sieci Web.  2. Języki opisu struktury dokumentu. 3. Język HTML, projektowanie stron WWW: tekst, lista, obrazy, multimedia , interaktywny formularz HTML: akcje i dane, tabele 4. Arkusze stylu. - CSS 5. XML: struktura logiczna a prezentacja 6. DTD oraz XML Schema jako języki opisu dokumentu 7. Transformacja XSL 8. Obiekty formatujące (XSL:FO) 9. Powiązania treści: XPath, XLink, XPointer 10. SVG",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 6.0 Projekt: 20.0 Seminarium: 0.0 RAZEM: 41.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur 1. Bates, Ch.: XML in Theory and Practice, John Wiley & Sons, 2003 2. Mangano, S.: XSLT. Receptury. Helion 2007 Uzupełniająca lista lektur w3schools.com",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania HTML, XML, XML Schema, XSLT,",
        "plik": "372985.pdf"
    },
    {
        "nazwa_przedmiotu": "Calculus,",
        "kod_przedmiotu": "PG_00045353",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2024/2025",
        "rok": "1",
        "semestr": "1",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki",
        "cel_przedmiotu": "Uzyskanie przez studenta kompetencji w posługiwaniu się aparatem analizy matematycznej i umiejętności rozwiązywania prostych zagadnień występujących w dziedzinach inżynierskich, w szczególności w inżynierii danych.",
        "efekty_uczenia_sie": "[K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student potrafi dokonać analizy problemu a następnie wybrać spośród metod poznanych podczas zajęć narzędzia potrzebne do jego poprawnego rozwiązania. [SU1] Ocena realizacji zadania [SU2] Ocena umiejętności analizy informacji [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student zna podstawowe twierdzenia, metody i narzędzia poznane podczas zajęć i wie, jak je wykorzystywać. [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 10:11 Strona 2 z 3",
        "tresc_przedmiotu": "• Granice właściwe i niewłaściwe funkcji. Asymptoty pionowe i poziome. Ciągłość funkcji. • Pochodna funkcji jednej zmiennej. Interpretacja geometryczna i fizyczna. Podstawowe wzory na pochodne. • Pochodna iloczynu, ilorazu, pochodna funkcji złożonej. Pochodne wyższych rzędów. Informacja o pochodnych cząstkowych • Zastosowania pochodnej. Reguła de L'Hospitala. Różniczka funkcji. Ekstrema, wklęsłość i wypukłość, punkty przegięcia, asymptoty ukośne. • Całka nieoznaczona. Całkowanie podstawowych klas funkcji. Podstawowe metody całkowania: przez podstawienie, przez części, przez rozkład na ułamki proste, podstawienia trygonometryczne. • Całka oznaczona Riemanna. Interpretacja geometryczna. Twierdzenie podstawowe rachunku całkowego. • Zastosowanie całki oznaczonej do obliczania pól figur płaskich, objętości brył obrotowych, długości łuków. • Szeregi liczbowe. Przykłady szeregów zbieżnych i rozbieżnych. Podstawowe kryteria zbieżności szeregów liczbowych. • Szeregi potęgowe. Promień i przedział zbieżności. • Szeregi Taylora i McLaurina. Podstawowe rozwinięcia. Całkowanie i różniczkowanie szeregów potęgowych. • Informacja o szeregach Fouriera",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Zaliczenie przedmiotu Matematyka Elementarna",
        "lista_lektur": "Podstawowa lista lektur   • H. Anton, Calculus with analytic geometry, John Wiley & Sons, 1989. • Matematyka. Podstawy z elementami matematyki wyższej, edited by B.  Wikieł, PG publishing house • J.Dymkowska, D.Beger, Rachunek różniczkowy w zadaniach, PG publishing hous • J.Dymkowska, D.Beger, Rachunek całkowy w zadaniach, PG publishing house • B.Sikora, E. Łobos, Advanced calculus - selected topics, Publishing house of Silesian University of Technology, 2009.  Uzupełniająca lista lektur • B.Sikora, E.Łobos, A first course in calculus, Publishing house of Silesian University of Technology, 2010. • H. Anton, Calculus : a new horizon, John Wiley & Sons, 6th ed • K. Jankowska, T. Jankowski,  Zbiór zadań z matematyki, PG publishing house, 2010 • W. Żakowski, Algebra i analiza matematyczna dla licealistów i kandydatów na wyższe uczelnie, WNT, Warszawa 1999 • M. Gewert, Z.Skoczylas, Analiza Matematyczna 1, GiS • M.Gewert, Z. Skoczylas, Analiza Matematyczna 2,  GIS 2007;",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Wyznacz ekstrema lokalne i przedziały monotoniczności podanej funkcji f(x)=(ln2x)/x 2. Oblicz pole obszaru ograniczonego krzywą y=x ln(x) i osią OX od x=e do x=e. 3. Obliczyć objętość bryły powstałej przez obrót krzywej o równaniu y=1/ (x2+2x+5) dookoła osi OX. Wykonać rysunek. 4. Zbadać zbieżność szeregu o wyrazie ogólnym an= (2nn!) / (nn). 5. Stosując twierdzenia o różniczkowaniu lub całkowaniu szeregów funkcyjnych wyznacz sumę szeregu potęgowego xn / (n+1) a następnie wyznacz sumę szeregu liczbowego 1/((n+1)2n)",
        "plik": "372987.pdf"
    },
    {
        "nazwa_przedmiotu": "Visualization of economic data,",
        "kod_przedmiotu": "PG_00053007",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii",
        "cel_przedmiotu": "Celem przedmiotu jest nabycie umiejętności konstruowania efektywnego przekazu graficznego w komunikacji gospodarczej z pomocą narzędzi i rozwiązań informatycznych.",
        "efekty_uczenia_sie": "[K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student przygotowuje i przedstawia w sposób przekonujący profesjonalne analizy wizualne. [SU2] Ocena umiejętności analizy informacji [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student identyfikuje wiarygodne źródła informacji wizualnych, oraz wykorzystuje odpowiednie metody wizualizacji danych w celu efektywnej komunikacji gospodarczej. [SW2] Ocena wiedzy zawartej w prezentacji  Data wygenerowania: 13.02.2025 13:35 Strona 2 z 3",
        "tresc_przedmiotu": "Historia grafiki statystycznej  Wizualizacja informacji w procesie komunikacji gospodarczej i inżynierskiej.  Rola informacji wizualnej w procesie podejmowania decyzji Ergonomia przekazu graficznego. Charakterystyka odbiorcy informacji. Ograniczenia percepcyjne i poznawcze odbiorcy Podstawowe formy prezentacji informacji wizualnej: diagramy, wykresy, schematy. Wizualizacja danych ilościowych Wizualizacja danych jakościowych Eksploracja interakcji statystycznych Eksploracja szeregów czasowych Analiza skupień (metoda Warda, metoda k-średnich) Podstawy GIS Analiza i wizualizacja danych geoprzestrzennych (danych przestrzennych) Wizualizacja pojęć symbolicznych",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur Biecek P. „Odkrywac! Ujawniać! Objaśniać! Zbiór esejów o sztuce pokazywania danych”, 2014.  Tufte E.R., „The visual display of quantitative information”, 2001 Wilkinson L., “The Grammar of Graphics'', 2005. Uzupełniająca lista lektur Clarke K.C., „Getting started with geographic Information Systems”, 2001.  Murray S.: Interaktywna wizualizacja danych. Wyd. Helion Warszawa 2013. Tufte E.: Envisioning Information. Graphic Press, Cheshire, CY, USA, 1996.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania - opracowanie prezentacji danych dotyczących wybranego zjawiska  - ocena zrozumiałości wybranego przekazu wizualnego - zasady prezentacji danych do celów analityki biznesowej  Data wygenerowania: 13.02.2025 13:35 Strona 3 z 3",
        "plik": "372988.pdf"
    },
    {
        "nazwa_przedmiotu": "Intellectual property protection,",
        "kod_przedmiotu": "PG_00045367",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Filozofii i Metodologii Nauk",
        "cel_przedmiotu": "Przekazanie studentom podstaw wiedzy z zakresu ochrony własności intelektualnej.",
        "efekty_uczenia_sie": "[K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student podejmuje etyczne decyzje dotyczące ochrony własności intelektualnej poprzez odpowiedzialne zarządzanie i komercjalizację innowacji, patentów, praw autorskich i innych aktywów własności intelektualnej [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_K01] wykazuje się świadomością kwestii prawnych, etycznych i różnorodności kulturowej, podejmując społecznie odpowiedzialne decyzje Student wykazuje się świadomością prawną, etyczną i kulturową przy podejmowaniu decyzji dotyczących ochrony własności intelektualnej, uwzględniając odpowiedzialność społeczną w zakresie zarządzania innowacjami, patentami, prawami autorskimi i innymi formami własności intelektualnej. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student identyfikuje wiarygodne źródła informacji dotyczące ochrony własności intelektualnej, takie jak patenty, prawa autorskie, znaki towarowe, wzory przemysłowe [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 13.02.2025 13:37 Strona 2 z 2",
        "tresc_przedmiotu": "1. Ochrona twórczości rys historyczny.  2. Problematyka własności intelektualnej w doktrynie prawniczej. 3. Prawo własności przemysłowej charakterystyka ogólna. Wynalazki, wzory użytkowe, wzory przemysłowe przepisy wspólne. 4. Struktura, organizacja i zadania Urzędu Patentowego. 5. Prawne podstawy zwalczania nieuczciwej konkurencji. Czyny nieuczciwej konkurencji. 6. Prawo autorskie - przedmiot prawa autorskiego, zakres ochrony i przesłanki jej stosowania. Podmiot prawa autorskiego. 7. Treść prawa autorskiego autorskie prawa osobiste i majątkowe. Dozwolony użytek utworów chronionych przepisami prawa autorskiego. Plagiaty.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 15.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur 1. E.Nowińska, U. Promińska, M.du Vall, Prawo własności przemysłowej. Przepisy i omówienie, Warszawa 2003.  2. J. Sobczak, Prawo autorskie i prawa pokrewne, Warszawa Poznań 2000. Uzupełniająca lista lektur 1. Ustawa z dnia 4 lutego 1994 r. prawo autorskie i prawa pokrewne (DZ.U. z 2000r, Nr 80, poz. 904, DZ.U. z 2001r Nr 128, poz. 1402, Dz. U. z 2002r Nr 126, poz. 1068, Nr 197, poz. 1662);  2. Ustawa z dnia 30 czerwca 2000 r. prawo własności przemysłowej (Dz. U. z 2001r., Nr 49 poz. 508, Dz. U. z 2002r. Nr 74, poz. 676, Nr 108, poz. 945, Nr 113, poz. 983, Nr 153, poz. 1271).  3. Ustawa z dnia 11 kwietnia 2001 r. o rzecznikach patentowych (Dz. U. z 2001r Nr 49, poz. 509).",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Co jest przedmiotem prawa autorskiego?  2. Co jest przedmiotem prawa własności przemysłowej?",
        "plik": "372990.pdf"
    },
    {
        "nazwa_przedmiotu": "Programming languages,",
        "kod_przedmiotu": "PG_00045303",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydziały Politechniki Gdańskiej -> Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Algorytmów",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie się z popularnymi paradygmatami programowania i zdobycie umiejętności ich praktycznego wykorzystywania.",
        "efekty_uczenia_sie": "[K6_W81] posiada znajomość struktur gramatycznych oraz obszarów leksykalnych niezbędnych do porozumiewania się w języku obcym w zakresie języka ogólnego oraz specjalistycznego związanego z kierunkiem studiów Zna podstawowe pojęcia związane z paradygmatami programowania, umie nazwać najważniejsze elementy konstrukcji w poszczególnych językach [SW3] Assessment of knowledge contained in written work and projects [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Potrafi zaprogramować rozwiązanie zadanego problemu z wykorzystaniem zadanego języka programowania z różnych paradygmatów [SU2] Assessment of ability to analyse information [SU4] Assessment of ability to use methods and tools [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Rozpoznaje paradygmaty programowania, umie dobrać metodologię do problemu programistycznego [SK5] Assessment of ability to solve problems that arise in practice [SK2] Assessment of progress of work  Data wygenerowania: 30.09.2025 17:25 Strona 2 z 3",
        "tresc_przedmiotu": "1. Programowanie proceduralne.  2. Składnia liniowa. FORTRAN 3. Rekordy aktywacyjne i podprogramy 4. Rekurencyjne wywołanie procedur. 5. Składnia blokowa. Abstrakcja przepływu sterowania. 6. Wiązanie nazw z obiektami. Zasięg wiązania. 7. Parametry wywołania procedury. Tryby przekazu parametrów. 8. Rekordy aktywacyjne dla języków z rekurencją. 9. Wywołania statyczne i dynamiczne. ALGOL. PASCAL. 10. Ograniczenia języków blokowych. 11. Abstrakcja danych i ochrona dostępu. 12. Modularyzacja. MODULA-2. ADA83, ADA95 13. Sytuacje wyjątkowe. Modele obsługi wyjątków. 14. Współprogramy i procedury współbieżne. Rendezvous. 15. Programowanie obiektowe. Obiekty, klasy, hierarchie. 16. Typy dynamiczne. Polimorfizm. SMALLTALK. C++. 17. Rekurencyjne interpretowanie poleceń. 18. Przekształcenia symboliczne. Rekurencja ogonowa. 19. Funkcyjny paradygmat programowania. 20. Haskell. Podstawowe konstrukcje i operacje, tworzenie modułów, wydajność. 21. Tacit programming. 22. LISP. Ogólny zarys. 23. Prolog jako przykład programowania w logice. 24. Definiowanie języków. Klasyfikacja Chomsky'ego, kompilatory. 25. Monady.  Data wygenerowania: 30.09.2025 17:25 Strona 3 z 3",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur 1. S. Mangano: XSLT receptury, wyd.2, Helion 2007  2. Cincom Smalltalk Downloads, http://www.cincomsmalltalk.com/ 3. SAXON - The XSLT and XQuery Processor, http:// saxon.sourceforge.net/ 4. W.F. Clocksin, W.F., Mellish, C.S.: Prolog Programowanie. Helion 2003 5. Ada Programming, http://en.wikibooks.org/wiki/Ada 6. SWI-Prolog downloads, www.swi-prolog.org/download.html 7. ADA Core, the GNAT Pro Company, http://www.adacore.com/home, https://libre.adacore.com/ 8. D. S. Touretzky: Common Lisp: A Gentle Introduction to Symbolic Computation, http://www.cs.cmu.edu/~dst/LispBook/ 9. Z. Huzar, Z. Fryźlewicz, I. Dubielewicz, B. Hnatk: Ada 95, Helion 1998 10. Polski serwis języka Smalltalk, http://www.objectspace.net/ Uzupełniająca lista lektur http://en.wikipedia.org/wiki/Programming_paradigm",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Zajęcia praktyczne w ramach przedmiotu Nie dotyczy",
        "plik": "372991.pdf"
    },
    {
        "nazwa_przedmiotu": "Digital Technologies for Business Communication,",
        "kod_przedmiotu": "PG_00053094",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydziały Politechniki Gdańskiej -> Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Przedmiot ma na celu:  · Poznanie metod komunikacji w nowoczesnej organizacji · Zrozumienie różnych kanałów komunikacji, · Zrozumienie jak prawidłowo powinna przebiegać komunikacja. · Nabycie umiejętności posługiwania się nowoczesnym narzędziami do komunikacji",
        "efekty_uczenia_sie": "[K6_U03] wykazuje się profesjonalnym i efektywnym działaniem w ramach pracy zespołowej, zarówno w roli lidera, jak i członka zespołu Student potrafi efektywnie współpracować z innymi w przygotowaniu spotkań i wideokonferencji oraz wspólnie opracowywać dokumenty i inne treści, wykazując się profesjonalizmem zarówno jako lider, jak i członek zespołu. [SU3] Assessment of ability to use knowledge gained from the subject [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student potrafi zorganizować wideokonferencję i zaplanować spotkanie, a także przygotować i przedstawić w sposób profesjonalny wyniki swoich działań wraz z ich zaawansowaną interpretacją. [SU5] Assessment of ability to present the results of task [K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student potrafi identyfikować wiarygodne źródła informacji w różnych kanałach (portal intranetowy, e-maile i inne) oraz na ich podstawie tworzyć raporty i opracowania. [SW3] Assessment of knowledge contained in written work and projects",
        "tresc_przedmiotu": "Wykorzystanie poczty e-mail w procesie komunikacji  Organizacja spotkań i zarządzanie czasem za pomocą narzędzi IT Wykorzystywanie narzędzi IT do udostępnia treści. Zarządzania prawami dostępu do treści. Zarządzanie treścią na portalach intranetowych Praca grupowa Organizowanie wideokonferencji -  narzędzia do komunikacji i pracy zdalnej",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur Quirke B. (2013). Komunikacja wewnętrzna krok po kroku. Wolters- Kluwer.  Cornelissen, J. (2012). Komunikacja korporacyjna. Przewodnik po teorii i praktyce Wolters-Kluwer. Uzupełniająca lista lektur Żbikowska K. (2013). Komunikacja biznesowa oczami kierownika projektu. Helion OnePress.  Rzepka B. (2012). Efektywna komunikacja w zespole. Wyd. Samo Sedno, Warszawa",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Planowanie spotkań z analizą dostępności poszczególnych uczestników  Zakładanie przestrzeni do współdzielenie treści Nadanie uprawnień do przestrzeni z treścią Tworzenie wideokonferencji Zajęcia praktyczne w ramach przedmiotu Nie dotyczy",
        "plik": "372992.pdf"
    },
    {
        "nazwa_przedmiotu": "Marketing,",
        "kod_przedmiotu": "PG_00045361",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydziały Politechniki Gdańskiej -> Wydział Zarządzania i Ekonomii -> Katedra Marketingu",
        "cel_przedmiotu": "Zapoznanie się z podstawową wiedzą marketingową, rozwój umiejętności w zakresie zarządzania marketingowego, a w szczególności formułowania strategii marketingowej i programów marketingowych.",
        "efekty_uczenia_sie": "[K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Student potrafi gromadzić i integrować dane marketingowe z różnych źródeł w celu analizy złożonych problemów rynkowych i formułowania rekomendacji strategicznych dla przedsiębiorstwa. [SW2] Ocena wiedzy zawartej w prezentacji [K6_K01] wykazuje się świadomością kwestii prawnych, etycznych i różnorodności kulturowej, podejmując społecznie odpowiedzialne decyzje Student potrafi uwzględniać aspekty prawne, etyczne i różnorodność kulturową przy tworzeniu strategii marketingowych oraz podejmować decyzje zgodne z zasadami społecznej odpowiedzialności biznesu. [SK1] Ocena umiejętności pracy w grupie [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student potrafi przygotować i w przekonujący sposób zaprezentować wyniki analiz marketingowych, wraz z ich zaawansowaną interpretacją i znaczeniem dla strategii firmy. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU2] Ocena umiejętności analizy informacji  Data wygenerowania: 21.09.2025 07:29 Strona 2 z 2",
        "tresc_przedmiotu": "Wykłady: Geneza, koncepcje  i pojęcia marketingu. System marketingu i jego elementy. Otoczenie dalsze i bliższe. Segmentacja i wybór rynku docelowego. Badania marketingowe. Klienci i ich zachowania. Polityka produktu. Polityka ceny. Polityka dystrybucji. Polityka promocji. Planowanie marketingowe i strategia.  Ćwiczenia: Realizacja zadań - studia przypadków",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur   Stone, M. A. & Desmond, J. (2007). Fundamentals of marketing. Routledge. Kotler, P., & Amstrong, G. (2012). Principles of Marketing, 14ed. Global edition. Jakarta. Hal. Kotler, P., & Keller, K. L. (2016). A Framework for Marketing Management, 6ed. Global edition. Pearson Education Limited.  Uzupełniająca lista lektur Artykuły polecone przez prowadzącego.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania segmentacja rynku, określenie poziomów produktu, strategia marketingowa",
        "plik": "372993.pdf"
    },
    {
        "nazwa_przedmiotu": "Software engineering,",
        "kod_przedmiotu": "PG_00045302",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydziały Politechniki Gdańskiej -> Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów z obszarami analizy i projektowania na tle innych obszarów działań projektu informatycznego oraz praktyczna nauka wykorzystania języka modelowania UML do analizy i projektowania systemów IT.",
        "efekty_uczenia_sie": "[K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student potrafi opisać organizację będącą klientem/odbiorcą projektu informatycznego, wymagania względem tworzonego systemu informatycznego oraz wyrazić te wymagania w ustrukturalizowanym języku modelowania. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student potrafi tworzyć modele analityczne obejmujące różne perspektywy spojrzenia na system (funkcjonalna, strukturalna, dynamiczna) oraz dbać o spójność pomiędzy tymi modelami. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student realizuje w zespole projekt dla wybranego tematu, wykorzystując w tym celu wiedzę z wykładów oraz narzędzia w postaci języka modelowania i systemu CASE (Computer Aided Software Engineering). [SK2] Ocena postępów pracy [SK1] Ocena umiejętności pracy w grupie  Data wygenerowania: 14.09.2025 12:20 Strona 2 z 2",
        "tresc_przedmiotu": "1. Wprowadzenie do przedmiotu 2. Zakres i przedmiot inżynierii oprogramowania. Podstawowe motywacje i pojęcia 3. Obszary i procesy inżynierii oprogramowania 4. Cykle życia oprogramowania (zarys) 5. Metodyki wytwarzania oprogramowania (zarys) 6. Pojęcie modelowania konceptualnego. Języki specyfikacji i modelowania. 7. Przypadki użycia 8. Obiektowe podejście do analizy systemu w UML 9. Modelowanie logicznej struktury systemu: diagramy klas 10. Modelowanie struktury: inne diagramy struktury 11. Modelowanie dynamiki: diagramy sekwencji i komunikacji 12. Modelowanie dynamiki: diagramy stanów i czynności 13. Inżynieria wymagań: pozyskiwanie, analiza i walidacja wymagań 14. Inżynieria wymagań: specyfikowanie wymagań 15. Projektowanie: architektura systemu 16. Projektowanie: projekt ogólny (wysokiego poziomu) i projekt klas (szczegółowy) 17. Projektowanie: wzorce projektowe 18. Projektowanie: zasady SOLID 19. Metodyka Scrum",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur 1. Sacha K., Inżynieria Oprogramowania, PWN, 2010 2. Pressman R., Maxim B., Software Engineering: a Practitioners Approach, McGraw-Hill, 9th edition, 2019 3. Booch G., Rumbaugh J., Jacobsen I.: UML przewodnik użytkownika, WNT, 2002 Uzupełniająca lista lektur 1. Sommerville I., Software Engineering, 10th edition, Addison- Wesley, 2015 2. Maciaszek L.: Requirements analysis and system design, Addison- Wesley, 2007 3. Fowler M., Scott K.: UML w kropelce 2.0, Lupus 2005 4. McLaughlin B., Pollice G., West D., Head First: Object-Oriented Analysis and Design, Edycja polska (Rusz głową!), Helion, 2008",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania • Narysuj diagram UML (np. klas, przypadków użycia, stanów) na podstawie podanego opisu wymagań względem systemu. • Przedstaw określony model wytwarzania oprogramowania i omów jego zalety i wady. • Wymień i opisz techniki specyfikacji wymagań względem systemu.",
        "plik": "372995.pdf"
    },
    {
        "nazwa_przedmiotu": "Mathematical statistics,",
        "kod_przedmiotu": "PG_00045298",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydziały Politechniki Gdańskiej -> Wydział Zarządzania i Ekonomii",
        "cel_przedmiotu": "Poznanie podstawowych pojęć probabilistyki i ich zastosowania w modelowaniu matematycznym. Poznanie klasycznych rozkładów probabilistycznych, ich własności i zastosowań w zagadnieniach praktycznych w różnych dziedzinach nauki i techniki. Student definiuje przestrzeń prób, rozkłady statystyk z próby, estymatory, hipotezy statystyczne, testy parametryczne i nieparametryczne. Student planuje i przeprowadza badania statystyczne wykorzystując Python oraz Visual Studio Code.",
        "efekty_uczenia_sie": "[K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student potrafi dobierać i stosować zaawansowane metody statystyki matematycznej oraz narzędzia analityczne do projektowania innowacyjnych rozwiązań w zakresie analizy i przetwarzania danych [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student potrafi wykorzystać narzędzia informatyczne do pozyskiwania, analizy i przetwarzania danych statystycznych, wspierając procesy decyzyjne w zastosowaniach biznesowych. [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania [K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Student zna podstawowe techniki matematyczne niezbędne do przeprowadzenia obliczeń z zakresu rachunku prawdopodobieństwa, statystyki matematycznej. [SW1] Ocena wiedzy faktograficznej [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 29.09.2025 22:33 Strona 2 z 2",
        "tresc_przedmiotu": "Przestrzeń probabilistyczna: schemat klasyczny, losowanie ze zwracaniem i bez zwracania, schematy urnowe i ich interpretacja. Prawdopodobieństwo geometryczne. Prawdopodobieństwo warunkowe, prawdopodobieństwo całkowite, wzór Bayesa. Niezależność zdarzeń.  Zmienna losowa dyskretna: funkcja rozkładu prawdopodobieństwa i dystrybuanta. Przegląd wybranych rozkładów zmiennych losowych typu dyskretnego: rozkład jednopunktowy, dwupunktowy, dwumianowy, Poissona. Zmienna losowa ciągła: funkcja gęstości prawdopodobieństwa i dystrybuanta. Przegląd wybranych rozkładów zmiennych losowych typu ciągłego: rozkład jednostajny, wykładniczy, normalny, chi- kwadrat, t- Studenta. Podstawowe charakterystyki liczbowe rozkładu zmiennej losowej dyskretnej i ciągłej. Populacja i próba; Schematy losowania; Rozkłady z próby. Przestrzeń prób; Podstawowe statystyki i ich rozkłady; Estymatory i ich własności; Metody uzyskiwania estymatorów; Estymacja punktowa; Estymacja przedziałowa; Testowanie hipotez statystycznych; Poziom istotności i moc testu; Parametryczne testy dla populacji jednowymiarowych. Parametryczne testy dla populacji dwuwymiarowych. Testy dla populacji wielowymiarowych. Analiza wariancji. Testy nieparametryczne. Test zgodności; Testy normalności; Test niezależności Chi-kwadrat; Testy losowości. Testy znaków. Test serii. Testy outlierów; Testy w analizie korelacji i regresji.",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 30.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 75.0",
        "wymagania_wstepne": " Matematyka, rachunek prawdopodobieństwa, statystyka opisowa.",
        "lista_lektur": "Podstawowa lista lektur 1. Casella, G., & Berger, R. L. (2002). Statistical inference (2nd ed.). Pacific Grove, CA: Duxbury. 2. Rice, J. A. (2006). Mathematical statistics and data analysis (3rd ed.). Belmont, CA: Duxbury Press. 3. Grus, J. (2019). Data science from scratch: First principles with Python (2nd ed.). Sebastopol, CA: OReilly Media. Uzupełniająca lista lektur 1. McClave J. T., Benson P. G., Sincich T. (2008), Statistics for Business and Economics, Pearson/Prentice Hall. 2. Douglas Lind, William Marchal and Samuel Wathen, Statistical Techniques in Business and Economics, 19th Edition, McGraw Hill. 3. Agresti A., Kateri M. (2022), Foundations of Statistics for Data Scientists: With R and Python, Chapman and Hall/CRC. 4. Lehmann, E. L., & Romano, J. P. (2022). Testing statistical hypotheses (4th ed.). Cham, Switzerland: Springer",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Zadanie rachunkowe z zakresu probabilistyki oraz twierdzeń granicznych.  2. Zadanie rachunkowe z zakresu estymacji punktowej i przedziałowej, precyzja szacunku, minimalna liczebność próby niezbędna do uzyskania określonej precyzji. 3. Test hipotezy parametrycznej. 4. Test hipotezy nieparametrycznej. Egzamin - zagadnienia teoretyczne, pisemny, ewentualnie krótkie zadania rachunkowe do rozwiązania.",
        "plik": "372996.pdf"
    },
    {
        "nazwa_przedmiotu": "Knowledge management,",
        "kod_przedmiotu": "PG_00045362",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Zarządzania",
        "cel_przedmiotu": "1. Prezentacja istoty procesu zarządzania wiedzą dla organizacji.2. Prezentacja aktualnej wiedzy teoretycznej z dziedziny.3. Prezentacja kluczowych wyzwań związanych z zarządzaniem wiedzą i najlepiej znanymi praktykami.4. Kreowanie postawy \"otwartej na wiedzę\", jej standardowych i niestandardowych źródeł, z naciskiem na umiejętność rozpoznawania źródeł wiedzy, transferu wiedzy i wykorzystania wiedzy.",
        "efekty_uczenia_sie": "[K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym Student analizuje procesy zarządzania wiedzą i kapitałem intelektualnym, uwzględniając techniczne, prawne, ekonomiczne, finansowe i społeczne uwarunkowania [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW1] Ocena wiedzy faktograficznej [K6_U03] wykazuje się profesjonalnym i efektywnym działaniem w ramach pracy zespołowej, zarówno w roli lidera, jak i członka zespołu Student efektywnie współpracuje w zespole przy analizie procesów zarządzania wiedzą i kapitałem intelektualnym, wykazując się profesjonalizmem zarówno jako lider, jak i członek zespołu [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student podejmuje kompetentne i etyczne decyzje w obszarze zarządzania wiedzą i kapitałem intelektualnym, [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [SK3] Ocena umiejętności organizacji pracy",
        "tresc_przedmiotu": "1. Knowledge  2. Knowledge Management    3. Intellectual Capital & Knowledge Strategy  4. Tacit Knowledge & Innovation  5. Knowledge Workers  6. Knowledge Risks 7. Knowledge Culture  8. Knowledge & Intelligence  9. Knowledge & Change Management 10. Learning Organizations 11. Learning/Unlearning 12. Learning from errors  13.Unconcious mind 14. Idiots everywhere?!-about mindsets 15.Knowledge Management: summary  Data wygenerowania: 17.03.2025 22:27 Strona 2 z 2",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 15.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Podstawy zarządzania.  Podstawy marketingu. Podstawy ekonomii.",
        "lista_lektur": "Podstawowa lista lektur Nonaka, I., & Takeuchi, H. (1995), The Knowledge-Creating Company, Oxford University Press.  Erickson, S.,  & Rothberg, H.N. (2008), From Knowledge to Intelligence, Elsevier. Massingham. P. (2016), Knowledge Management, Sage. Morabito, J. et al. (2015),Designing Knowlege Organizations, Wiley. Voehl, F, Harrington, H.J. (2015), Change Management. C.R.C. Press. Bedford, D, Kucharska, W. (2020) Relating Information Culture to Information Policies and management Strategies, IGI Global.  Uzupełniająca lista lektur Milton, T., & Young, N. (2011),  Knowledge Mangement for Sales and Marketing, Chandos Publishing",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "372997.pdf"
    },
    {
        "nazwa_przedmiotu": "Essentials of accounting,",
        "kod_przedmiotu": "PG_00045300",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Zarządzania",
        "cel_przedmiotu": "Studenci zdobywają wiedzę na temat różnych kategorii sprawozdań finansowych. Uczą się charakteryzować aktywa i pasywa spółki. Potrafią zaksięgować podstawowe transakcje biznesowe. Nabywają umiejętność rozumienia sprawozdań finansowych",
        "efekty_uczenia_sie": "[K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student rozumie potrzebę samodoskonalenia poprzez uaktualnianie wiedzy na temat obowiązującego prawa podatkowego [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne Student potrafi analizować i oceniać złożone procesy rachunkowe, takie jak zarządzanie aktywami, pasywami, kapitałem, przychodami i kosztami. Wykorzystuje zróżnicowane metody do omawiania założeń oraz budowy bilansu i rachunku zysków i strat. [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student identyfikuje uwarunkowania procesów rachunkowych, takich jak współmierność, memoriał i ostrożność, oraz dobiera odpowiednie metody ich rozwiązania. Rozumie ogólnie przyjęte zasady rachunkowości, potrafi je zastosować w praktyce i analizować ich wzajemne relacje w kontekście zapewnienia 'prawdziwego i rzetelnego obrazu' w sprawozdaniach finansowych [SW2] Ocena wiedzy zawartej w prezentacji  Data wygenerowania: 17.03.2025 22:29 Strona 2 z 2",
        "tresc_przedmiotu": "1) rachunkowość finansowa  2) Źródła danych niezbędnych do prowadzenia biznesu w nowoczesnym otoczeniu, 3) podstawowe zasady rachunkowości, 5) Funkcje księgowości vs rachunkowości, 6) różne rodzaje księgowania; konta księgowe, jednostronne, dwustronne, zestawienia kont, sprawozdania kontrolne, 7) pojęcia aktywów, zobowiązań, kapitału, przychodów i kosztów, rachunków , 8) podstawowe równanie rachunkowe, 9) rola i funkcjonowanie księgi głównej, ksiąg pomocniczych, zasada księgowości podwójnej, bilans próbny, 10) Rola i funkcjonowanie otwarcia i zamknięcia saldem, 11) Główne pozycje bilansowe: aktywa trwałe, aktywa obrotowe, inwestycyjne, zadłużenie długoterminowe, zobowiązania krótkoterminowe, jak i materialne i niematerialne, zapasy, kapitał zakładowy, rentowność, 12) księgowanie i interpretacji podstawowych operacji gospodarczych: sprzedaż, zakup, wytwarzanie, inwestowanie środków pieniężnych, 14) Identyfikacja głównych kategorii wynikowych: przychody, koszty operacyjne, zysk brutto (marża brutto), pozycje finansowe, zyski i straty, zysk netto i zysk zatrzymany, 15) Różnica w rachunkowości firm handlowych, produkcyjnych i usługowych, 16) rozumienie pojęć: zakupu towaru, inwentaryzacja towaru, rabaty, zwroty i dodatki, koszty zakupu, zysk brutto na sprzedaży , 17)   Wycena zużycia metodami: FIFO, LIFO i średniej ważonej, 21) zapasy, 22) rachunkowość środków trwałych: zakup i sprzedaż, amortyzacja, obliczenie wartości rezydualnej, likwidacja, 23) Metody amortyzacji metoda liniową, degresywna, naturalna, degresywno-liniowa i sumy cyfr, 24) Założenia i budowa bilansu, rachunku zysków i strat.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Nie ma wymagań",
        "lista_lektur": "Podstawowa lista lektur Marshall, McManus & Viele, \"Accounting. What the Numbers Mean\", McGraw-Hill, 7th Edition. Uzupełniająca lista lektur Robins & Wood, \"Book-keeping and Accounting\", Prentice Hall, 5th Edition. Eisen, \"Accounting\", Barron\"s, 5th Edition.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "372999.pdf"
    },
    {
        "nazwa_przedmiotu": "Data quality assurance,",
        "kod_przedmiotu": "PG_00053008",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie z aspektami jakości danych w systemach informatycznych oraz organizacji programów poprawy jakości danych",
        "efekty_uczenia_sie": "[K6_K01] wykazuje się świadomością kwestii prawnych, etycznych i różnorodności kulturowej, podejmując społecznie odpowiedzialne decyzje Student potrafi dokonać identyfikacji oraz anonimizacji danych osobowych lub wrażliwych. Student potrafi zidentyfikować i usunąć w razie potrzeby dane naruszające godność drugiego człowieka. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student potrafi określić atrybuty i metryki jakości danych dla praktycznych zastosowań. Student potrafi określić i zaplanować działania zapewniające jakość danych w cyklu życia systemu. [SU1] Ocena realizacji zadania [K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student potrafi określić cele i zakres projektu poprawy jakości danych. Student potrafi określić działania poprawy jakości danych oraz ich weryfikacji [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 12.02.2025 10:29 Strona 2 z 2",
        "tresc_przedmiotu": "WYKŁADY: Wprowadzenie. Pojęcie jakości danych. Atrybuty jakości danych oraz wartość biznesowa danych. Jakość danych w etapach cyklu życia danych. Ocena i weryfikacja jakości danych. Programy poprawy jakości danych.   PROJEKT: Opracowanie programu oceny i doskonalenia jakości danych dla przykładowego systemu oraz wykonanie elementów tego planu.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Zaliczenie przedmiotu: Bazy danych",
        "lista_lektur": "Podstawowa lista lektur 1. Arkady Maydanchik, Data Quality Assessment, Technics Publications, 2007  2. Danette McGilvray, Executing Data Quality Projects, Elsevier, 2008 Uzupełniająca lista lektur ISO/IEC 25012, Software product Quality Requirements and Evaluation (SQuaRE) Data quality model",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania  - jak można zmierzyć poziom jakości danych? - jakie rodzaje działań można wykonać w celu poprawy jakości danych? - jakie są typowe problemy jakości danych podczas migracji i integracji danych? - jakie mechanizmy baz danych można stosować dla zapewnienia jakości danych?",
        "plik": "373000.pdf"
    },
    {
        "nazwa_przedmiotu": "Cybersecurity of Enterprise Infrastructure,",
        "kod_przedmiotu": "PG_00053095",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Nabycie wiedzy i umiejętności zarządzania infrastrukturą i bezpieczeństwem IT w przedsiębiorstwie",
        "efekty_uczenia_sie": "[K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student formułuje logiczne rozwiązania złożonych problemów związanych z bezpieczeństwem IT [SU2] Ocena umiejętności analizy informacji [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student przygotowuje i przedstawia profesjonalne prezentacje wyników analiz związanych z bezpieczeństwem IT, w tym szacowania ryzyka i kosztów [SU2] Ocena umiejętności analizy informacji [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów Student wykazuje się kreatywnym i przedsiębiorczym działaniem w analizie oraz szacowaniu ryzyka i kosztów związanych z bezpieczeństwem IT, formułując innowacyjne rozwiązania w zakresie ochrony infrastruktury IT oraz tworzenia dokumentacji bezpieczeństwa, dostosowanych do specyfiki przedsiębiorstwa. [SW2] Ocena wiedzy zawartej w prezentacji  Data wygenerowania: 13.02.2025 13:37 Strona 2 z 3",
        "tresc_przedmiotu": "WYKŁAD  Wprowadzenie do przedmiotu Infrastruktura IT przedsiębiorstwa Koszt związany z bezpieczeństwem IT Zarządzanie ryzykiem Szacowanie ryzyka Standardy bezpieczeństwa IT Zagrożenia bezpieczeństwa IT Dokumentacja bezpieczeństwa IT w przedsiębiorstwie (m.in. opis infrastruktury IT, opis procedur bezpieczeństwa) Środki ochrony bezpieczeństwa infrastruktury IT  LABORATORIUM Analiza infrastruktury IT przedsiębiorstwa Szacowanie ryzyka Szacowanie kosztu związanego z bezpieczeństwem IT Stworzenie dokumentacji bezpieczeństwa infrastruktury IT w przedsiębiorstwie Dobór środków ochrony bezpieczeństwa infrastruktury IT",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur Ross Anderson, Inżynieria zabezpieczeń, WNT 2005.  Adam Gałach, Instrukcja zarządzania bezpieczeństwem systemu Informatycznego, ODDK 2004. Janusz Zawiła-Niedźwiecki, Franciszek Wołowski, Bezpieczeństwo systemów informacyjnych: Praktyczny przewodnik zgodny z normami polskimi i międzynarodowymi, Edu-Libri, Kraków - Warszawa, 1, 2012. Krzysztof Liderman, Analiza ryzyka i ochrona informacji w systemach komputerowych, PWN 2009. Tadeusz Kifner, Polityka bezpieczeństwa i ochrony informacji, Helion 1999.  Uzupełniająca lista lektur John Viega, Mity bezpieczeństwa IT: czy na pewno nie masz się czego bać?, Helion 2010.  Edward Amoroso, Wykrywanie intruzów, RM 1999. Bruce Schneier, Kryptografia dla praktyków. Protokoły, algorytmy i programy źródłowe w języku C, WNT 2002. Stuart McClure, Joel Scambray, George Kurtz, Hacking zdemaskowany. Bezpieczeństwo sieci - sekrety i rozwiązania, PWN 2006.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Przeanalizuj infrastrukturę IT przedsiębiorstwa a następnie przygotuj jej dokumentację.  Przeprowadź analizę ryzyka dla analizowanej infrastruktury IT. Zaproponuj środki bezpieczeństwa dla analizowanej infrastruktury IT. Podaj przykłady infrastruktur krytycznych. Przedstaw i omów podstawowe funkcje zapory sieciowej.",
        "plik": "373001.pdf"
    },
    {
        "nazwa_przedmiotu": "Agent systems,",
        "kod_przedmiotu": "PG_00045385",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Architektury Systemów Komputerowych",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studenta z teoretycznymi i praktycznymi podstawami tworzenia aplikacji rozproszonych w metodologii agentowej.",
        "efekty_uczenia_sie": "[K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student zna różne możliwe architektury wewnętrzne agenta i potrafi wybrać właściwą w zależności od cech środowiska i natury misji agenta. [SW1] Ocena wiedzy faktograficznej [K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne Student zna metody dekompozycji złożonych zadań i potrafi je zastosować. [SU2] Ocena umiejętności analizy informacji [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student opracowuje projekt systemu wieloagentowego, zawierający elementy kooperacji międzyagentowej. [SU1] Ocena realizacji zadania  Data wygenerowania: 10.03.2025 13:36 Strona 2 z 2",
        "tresc_przedmiotu": "1. Podanie zasad zaliczenia przedmiotu. 2. Wprowadzenie do problematyki systemów agentowych. 3. Definicja agenta i środowiska agentowego. 4. Modele i architektura agentowa. 5. Własności i zasady działania agenta BDI. 6. Zasady interakcji międzyagentowej. 7. Właściwości algorytmów agentowych. 8. Agentowe algorytmy wyszukiwania. 9. Agentowe algorytmy rekomendacji. 10. Agentowe algorytmy negocjacji. 11. Struktura aplikacji agentowej. 12. Cykl życia aplikacji agentowej. 13. Wykorzystanie usług w aplikacji agentowej. 14. Środowiska wytwarzania aplikacji agentowych. 15. Środowiska wykonania aplikacji agentowych. 16. Przykłady aplikacji agentowych. 17. Testy i kolokwia",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Podstawowa znajomość języka programowania Java i systemu operacyjnego Linux (linia poleceń) jest pomocna.",
        "lista_lektur": "Podstawowa lista lektur 1. Woolridge Michael: An Introduction to Multiagent Systems. 2. Weiss Gerhard (Ed.): Multiagent Systems - A Modern Approach to Distributed Artificial Intelligence. Uzupełniająca lista lektur 1. JADE - Users Guide (*) 2. JADE - Administrator Guide (*)  (*) literatura do części praktycznej przedmiotu",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Zaimplementuj mobilnego agenta. Udostępnij usługę realizowaną przez agenta w środowisku agentowym. Do czego służą ontologie w środowiskach agentowych?",
        "plik": "373003.pdf"
    },
    {
        "nazwa_przedmiotu": "Computer networks - lectures,",
        "kod_przedmiotu": "PG_00045321",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Teleinformatyki",
        "cel_przedmiotu": "Student uczy się: jak mówić o sieciach komputerowych - poznaje podstawowe pojęcia (np. protokół), ich znaczenie i związki; jak sieci komputerowe są zbudowane i wykorzystywane - uczy się podstaw działania sieci (np. komutacja pakietów) i architektury sieci (np. płaszczyzny sieci) oraz poznaje podstawowe technologie sieciowe (np. protokół IP); jak sieci komputerowe ewoluują - poznaje historię rozwoju sieci, ewolucję wymagań, procesy standaryzacyjne, perspektywy rozwoju.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych zna architekturę i strukturę sieci komputerowych, rozumie rolę i sposób wykorzystania poszczególnych elementów architecture i rozwiązań sieciowych do realizacji usług, transferu i przetwarzania danych [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji [K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne rozumie i ocenia wymagania usług teleinformatycznych, zna charakterystyki i ograniczenia technologii sieciowych, ocenia ich przydatność do realizacji usług, ocenia rozwiązania sieciowe pod kątem realizacji mechanizmów bezpieczeństwa, ocenia poziom bezpieczeństwa sieci i usług [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji [K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów zna architekturę podstawowych usług teleinformatycznych oraz zasady i protokoły komunikacji ich aplikacji, zna zasady działania sieci komputerowych oraz rozwiązania i technologie sieci lokalnych i rozległych [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 10:42 Strona 2 z 3",
        "tresc_przedmiotu": "1. Aplikacje i usługi sieci komputerowych (4)  2. Udziałowcy sieci komputerowych, wymagania udziałowców i aplikacji (2) 3. Podstawy działania sieci, architektury sieci i technologii sieciowych (4) 4. Organizacja sieci, usługi sieciowe oraz ewolucja sieci (2) 5. Sieci lokalne w domu, przedsiębiorstwie i centrum danych oraz ich technologie (4) 6. Rozwiązania i protokoły transportu danych przez sieć (4) 7. Struktura i organizacja sieci oraz rozwiązania i protokoły routingu (4) 8. Protokoły transportowe danych aplikacyjnych (4) 9. Bezpieczeństwo sieci (2)",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Nie ma wymagań wstępnych",
        "lista_lektur": "Podstawowa lista lektur Larry L. Peterson and Bruce S. Davie: Computer Networks: A Systems Approach, The Morgan Kaufmann Series in Networking, Morgan Kaufmann, sixth edition, 2021 Uzupełniająca lista lektur David D. Clark: Designing an Internet, The MIT Press, 2018  Douglas E. Comer: The Internet Book, Taylor & Francis, CRC Press, fifth edition, 2018 James F. Kurose and Keith W. Ross: Computer Networking, Pearson, eighth edition, 2020 Klasyczne artykuły i prezentacje wideo na temat historii i intelektualnych podstaw sieci komputerowych K. Nowicki, J. Woźniak: Przewodowe i bezprzewodowe sieci LAN, Oficyna Wydawnicza Politechniki Warszawskiej K. Nowicki, J. Światowiak: Protokoły IPv6 J. Woźniak, K. Nowicki: Sieci LAN, MAN, WAN - protokoły komunikacyjne, Wydawnictwa Postępu Telekomunikacji K. Nowicki: Materiały z wykładu Sieci Ethernet H. Krawczyk, S. Kaczmarek, K. Nowicki: Aplikacje i usługi a technologie sieciowe, Państwowe Wydawnictwa Naukowe",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Opis architektur sieciowych oraz podstawowych standardów. Porównanie standardowych  przewodowych i bezprzewodowych sieci LAN.  Porównanie metod i urządzeń łączenia sieci. Opis metod adresacji w sieciach LAN i WAN.  Opis wybranych protokołów routingu oraz podstawowych protokołów komunikacyjnych w sieciach IP. Opis wybranych aplikacji sieciowych.  Data wygenerowania: 12.02.2025 10:42 Strona 3 z 3",
        "plik": "373004.pdf"
    },
    {
        "nazwa_przedmiotu": "Internet services architectures,",
        "kod_przedmiotu": "PG_00045384",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Architektury Systemów Komputerowych",
        "cel_przedmiotu": "Poznanie nowoczesnych architektur systemów rozproszonych jak również poznanie i wykorzystanie technologii implementujących ww. architektury.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych wykorzystuje technologie informatyczne w celu projektowania i wdrażania rozwiązań chmurowych [SU1] Ocena realizacji zadania [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu opracowywania rozwiązań informatycznych pracujących w chmurze [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień znajduje oraz potrafi wykorzystać wiarygodne źródła informacji dotyczące projektowania i wdrażania rozwiązań chmurowych [SW1] Ocena wiedzy faktograficznej",
        "tresc_przedmiotu": "• Architektura złożonych aplikacji webowych. • Mechanizmy odwzorowania obiektowo-relacyjnego. • Styl architektoniczny wykorzystujący zmianę stanu poprzez reprezentację. • Dekompozycja aplikacji na mikrousługi. • Projektowanie i wdrażanie mikrousług. • Jednostronicowe aplikacje internetowe. • Systemy konteneryzacji. • Katalogowanie i wyszukiwanie usług. • Równoważenie obciążenia usług. • Migracja struktury bazy danych. • Mechanizmy wymiany komunikatów. • Mechanizmy uwierzytelniania i autoryzacji.",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Znajomość języka Java, JavaScript, SQL oraz protokołu HTTP",
        "lista_lektur": "Podstawowa lista lektur 1. Materiały wykładowe AUI/ISA dostępne w serwisie eNauczanie 2. Dokumentacja Spring Framework, 3. Dokumentacja RabbitMQ, 4. Dokumentacja Docker Uzupełniająca lista lektur Microservices Patterns: With examples in Java, Chris Richardson, 2018, Manning Publications",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "373005.pdf"
    },
    {
        "nazwa_przedmiotu": "Geographic information systems,",
        "kod_przedmiotu": "PG_00045320",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Systemów Geoinformatycznych",
        "cel_przedmiotu": "Nabycie przez studentów podstawowej wiedzy oraz umiejętności praktycznych z zakresu systemów informacji przestrzennej (GIS Geographic Information System) i danych przestrzennych, co obejmuje zarówno użytkowanie GIS jak i elementy programowania implementującego podstawowe funkcje GIS.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student programuje z wykorzystaniem technologii, narzędzi i bibliotek do przetwarzania danych przestrzennych. [SU1] Ocena realizacji zadania [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student potrafi zastosować narzędzia GIS do celów rozwiązywania problemów dotyczących pozyskiwania, przetwarzania oraz analizy informacji o charakterze przestrzennym. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student posiada wiedzę na temat budowy, struktury i funkcjonalności GIS oraz ich zastosowań, a także na temat źródeł, modeli i standardowych formatów danych przestrzennych oraz metod ich przetwarzania. [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 10:52 Strona 2 z 2",
        "tresc_przedmiotu": "1. Definicja, koncepcje, struktura, podstawowe pojęcia związane z GIS  2. Podstawowa funkcjonalność GIS. Warstwy tematyczne. Przykłady zastosowań GIS. Popularne aplikacje GIS 3. Modele danych w GIS: model wektorowy, obiekty proste (punkt, linia, wielobok) i złożone, model wektorowy z topologią i bez topologii, model rastrowy, model TIN 4. Wybrane formaty danych GIS. Standaryzacja modeli i formatów danych GIS 5. Modele i reprezentacja danych trójwymiarowych w GIS 6. Podstawy kartografii cyfrowej. Projekcje kartograficzne 7. Źródła danych dla GIS. Metody pozyskiwania danych do GIS, import i adaptacja danych istniejących, geokodowanie, digitalizacja, wektoryzacja 8. Techniki pomiarów danych dla GIS. Lotnicze i satelitarne obrazowanie Ziemi, skanowanie laserowe 9. Algorytmy przetwarzania danych wektorowych. Analizy i przekształcenia geometryczne. Geoprzetwarzanie 10. Podstawowe algorytmy przetwarzania danych rastrowych w GIS 11. Analizy przestrzenne przykłady i zastosowania 12. Otwarte technologie i biblioteki do przetwarzania danych przestrzennych oraz ich praktyczne wykorzystanie (przykładowo: GeoTools, Geoserver, OpenLayers, Cesium, Quantum GIS i skrypty w języku Python)",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Longley, P. A., Goodchild, M. F., Maguire, D. J., & Rhind, D. W. (2015). Geographic information science and systems. John Wiley & Sons. Uzupełniająca lista lektur S. Shekhar, H. Xiong (ed.), Encyclopedia of GIS. Springer, 2008",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Algorytmiczna analiza przestrzenna danych rastrowych  2. Geoprzetwarzanie i operacje topologiczne na danych wektorowych 3. Tworzenie Systemu Informacji Przestrzennej z wykorzystaniem narzędzi programistycznych",
        "plik": "373006.pdf"
    },
    {
        "nazwa_przedmiotu": "Diploma thesis 1,",
        "kod_przedmiotu": "PG_00045314",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Przygotowanie studenta do napisania inżynierskiej pracy dyplomowej w zakresie merytorycznym (wyszukiwanie literatury, formułowanie problemu, gromadzenia danych, dobór metod rozwiązania, interpretacja wyników) oraz formalnym (przygotowanie tekstu pracy zgodnie z obowiązującymi zasadami).",
        "efekty_uczenia_sie": "[K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów Student potrafi zrealizować postawione zadanie w sposób autorski, bazując na znanych narzędziach. [SW1] Ocena wiedzy faktograficznej [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Student wie, jak i gdzie znaleźć wiedzę na temat istniejących rozwiązań w podobnym zakresie jak realizowany projekt. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU2] Ocena umiejętności analizy informacji [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student zdobywa wiedzę odpowiednią do realizacji postawionego zadania, korzystając z narzędzi z różnych obszarów inżynierii. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce  Data wygenerowania: 12.02.2025 10:53 Strona 2 z 2",
        "tresc_przedmiotu": "1. Zapoznanie się z wymaganiami względem produktu mającego powstać w ramach projektu inżynierskiego 2. Analiza istniejących rozwiązań i narzędzi 3. Opracowanie harmonogramu realizacji projektu 4. Przydział zadań pomiędzy członków zespołu",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 15.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Regulamin dyplomowania na WETI PG (https://eti.pg.edu.pl/studenci/ dziekanat)   Uzupełniająca lista lektur brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   Zaprezentowanie opiekunowi projektu efektów realizacji postawionych zadań",
        "plik": "373007.pdf"
    },
    {
        "nazwa_przedmiotu": "Computer networks - laboratories,",
        "kod_przedmiotu": "PG_00045323",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Teleinformatyki",
        "cel_przedmiotu": "Nabranie umiejętności projektowania, budowy i konfigurowania sieci komputerowych.  Wykazanie się umiejątnosciami identyfikacji i analizy wybranych protokołów i mechanizmów sieci LAN i WAN",
        "efekty_uczenia_sie": "[K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student projektuje, buduje i konfiguruje sieć komputerową oraz analizuje poprawność jej pracy [SU1] Ocena realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Student potrafi konfigurować urządzenia i systemy sieciowe wykorzystując oprogramowanie przełączników i routerów [SU1] Ocena realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student wykazuje się znajomością elementów wchodzących w skład sieci (przełączników, routerów) [SW1] Ocena wiedzy faktograficznej",
        "tresc_przedmiotu": "Lab. 1. Zarządzanie siecią 2. Mechanizmy komunikacji między aplikacjami 3. Routing Statyczny i dynamiczny 4. Sieci bezprzewodowe 802.11 konfiguracja 5. Diagnostyka sieci IP 6. Monitorowanie sieci  Data wygenerowania: 12.02.2025 10:53 Strona 2 z 2",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 15.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Skrypty i moce dydaktyczne do poszczególnych ćwiczeń laboratoryjnych  Nowicki K.: Monitorowanie i bezpieczeństwo sieci komputerowych, WN AM Szczecin, 2016 Uzupełniająca lista lektur Nowicki K., Woźniak J.: Przewodowe i bezprzewodowe sieci LAN, OW PW 2002  Nowicki K.: Ethernet - sieci, mechanizmy, Infotech",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   Zbuduj sieć niezawodną Zbuduj sieć bezpieczną Zbuduj sieć wydajną",
        "plik": "373008.pdf"
    },
    {
        "nazwa_przedmiotu": "Large-scale enterprise applications,",
        "kod_przedmiotu": "PG_00045322",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Systemów i Sieci Radiokomunikacyjnych",
        "cel_przedmiotu": "Zapoznanie z architekturami biznesowych aplikacji wielkoskalowych i narzędziami do ich wytwarzania z wykorzystaniem platformy Java Enterprise Edition",
        "efekty_uczenia_sie": "[K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Projektuje biznesowe aplikacje wielkoskalowe, dobierając odpowiednie komponenty platformy Java EE w zależności od wymagań aplikacji. Zna platformy Java SE i Java EE. Zna i rozumie komponentowy model programowania EJB. [SW1] Ocena wiedzy faktograficznej [K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Zna architektury aplikacji rozproszonych opartych o platformę Java EE. Zna problemy współdzielenia stanu pomiędzy komponentami aplikacji. Zna technologie hipermediów i ich zastosowania w aplikacjach Java EE. [SW1] Ocena wiedzy faktograficznej [K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Programuje aplikacje w języku Java, uruchamia opracowane programy w środowisku serwera aplikacji, wykonuje testy integracyjne i funkcjonalne. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania",
        "tresc_przedmiotu": "1. Przegląd platformy Java SE, budowa aplikacji i model wykonania. 2. Proces budowania pliku wykonywalnego i narzędzia do zarządzania zależnościami. 3. Kolekcje i typy generyczne. 4. Standard Java Beans. 5. Typy wyliczeniowe. 6. Obsługa wątków w Javie. 7. Obsługa gniazd TCP i UDP w Javie programowanie sieciowe. 8. Wprowadzenie do platformy Java EE. 9. Servlety oraz JSP i JSTL. 10. Komponentowe wytwarzanie interfejsów z użyciem JSF. 11. Przetwarzanie danych w formatach XML i JSON. 12. Dostęp do baz danych z użyciem JPA. 13. Kontener EJB, komponenty stanowe i bezstanowe. 14. Transakcje w warstwie EJB i transakcje rozproszone. 15. Uwierzytelnianie i autoryzacja z użyciem JAAS. 16. Usługi sieciowe JAX-WS i JAX-RS. 17. Mikroserwisy w Javie EE.  Data wygenerowania: 12.02.2025 10:54 Strona 2 z 2",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Zaliczenie przedmiotu: programowanie obiektowe",
        "lista_lektur": "Podstawowa lista lektur 1. E. Jendrock, I. Evans, D. Gollapudi, K. Haase, C. Srivathsa: The Java EE 7 Tutorial, Oracle, 2014.  2. Specyfikacja API standardu Java EE 7: https://docs.oracle.com/ javaee/7/api/toc.htm. Uzupełniająca lista lektur 1. A. L. Rubinger, B. Burke: Enterprise JavaBeans 3.1, O'Reilly Media, 2010.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Obsługa bazy danych w biznesowych aplikacjach wielkiej skali.  2. Implementacja komponentów biznesowych aplikacji. 3. Projektowanie i implementacja zdalnych interfejsów dla aplikacji zorientowanych na usługi. 4. Uwierzytelnianie i autoryzacja w aplikacjach biznesowych.",
        "plik": "373009.pdf"
    },
    {
        "nazwa_przedmiotu": "Applications of geographic information systems,",
        "kod_przedmiotu": "PG_00045324",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Systemów Geoinformatycznych",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów z zaawansowanymi metodami pozyskiwania, składowania oraz przetwarzania, analizy i wielowymiarowej wizualizacji danych przestrzennych.",
        "efekty_uczenia_sie": "[K6_U03] wykazuje się profesjonalnym i efektywnym działaniem w ramach pracy zespołowej, zarówno w roli lidera, jak i członka zespołu W ramach pracy grupowej student potrafi skonstruować proste wizualizacje danych z wykorzystaniem bibliotek GIS. [SU1] Ocena realizacji zadania [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student zna podstawy konstrukcji aplikacji geoinformatycznych. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student potrafi dokonać analizy danych przestrzennych pozyskanych z różnych źródeł. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce  Data wygenerowania: 12.02.2025 10:54 Strona 2 z 2",
        "tresc_przedmiotu": "1. Zaawansowane metody pozyskiwania danych geoprzestrzennych z sensorów aktywnych i pasywnych.  2. Zaawansowane formaty i modele danych geoprzestrzennych (dane z sensorów laserowych, dane z sensorów akustycznych, dane z GPS; GML, KML, GeoJSON, LAS, Shapefile, 3DTiles). 3. Pozyskiwanie danych z otwartych źródeł (sensory satelitarne i lotnicze, publicznie dostępne bazy danych wektorowych). 4. Omówienie zaawansowanych metod przetwarzania i analizy danych geoprzestrzennych (m.in. korelacja, regresja, IDW, Kriging, Minimum Curvature, analiza trendu, modelowanie i symulacja zjawisk fizycznych w GIS) 5. Programowanie sieciowych Systemów Informacji Przestrzennej 6. Programowanie wielowymiarowych symulacji w kontekście Systemów Informacji Przestrzennej (modelowanie i wizualizacja 3D i 4D z wykorzystaniem popularnych bibliotek GIS)",
        "formy_zajec": "Wykład: 18.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 12.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " znajomość języka Java, Javascript, C++, python, znajomość obsługi systemów operacyjnych Unix/Linux and Windows,",
        "lista_lektur": "Podstawowa lista lektur Longley, P. A., Goodchild, M. F., Maguire, D. J., & Rhind, D. W. (2015). Geographic information science and systems. John Wiley & Sons. Uzupełniająca lista lektur Cressie, N., 1990. The origins of kriging. Mathematical geology, 22(3), pp.239-252.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1.Metody pozyskiwania rastrowych danych geograficznych  2.Metody analizy danych przestrzennych",
        "plik": "373010.pdf"
    },
    {
        "nazwa_przedmiotu": "Concurrent and distributed processing,",
        "kod_przedmiotu": "PG_00061802",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Architektury Systemów Komputerowych",
        "cel_przedmiotu": "Nauczenie podstaw oraz zasad przetwarzania rozproszonego i równoległego w sieciowych systemach komputerowych.",
        "efekty_uczenia_sie": "[K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student rozróżnia podstawowe wzorce projektowe w programowaniu spółbieżnym i potrafi je opisać [SW1] Ocena wiedzy faktograficznej [K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Student potrafi podac genezę zjawiska wyścigu i zastosować odpowiednie metody ochrony przed wystąpieniem tego zjawiska. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student wytwarza nietrywialną aplikację rozproszoną realizującą współbieżne przetwarzanie danych i ochronę synchronizowanego globalnego stanu. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania  Data wygenerowania: 10.03.2025 13:37 Strona 2 z 2",
        "tresc_przedmiotu": "1. Zapoznanie z przedmiotem. Przedstawienie zasad zaliczeń 2. Abstrakcja programowania rozproszonego i współbieżnego 3. Przetwarzanie rozproszone i równoległe w przykładach 4. Sekcja krytyczna wprowadzenie 5. Przegląd klasycznych problemów: producent konsument, czytelnicy pisarze, pięciu filozofów 6. Semafory szczegółowa klasyfikacja i omówienie 7. Procedury współbieżne i procedury wielowejściowe 8. Rozwiązania typowych problemów z zastosowaniem semaforów 9. Semafory binarne i uogólnione w systemie Unix 10. Programowanie wielowątkowe 11. Synchronizacja dostępu i wykonania dla wątków i procesów 12. Biblioteki funkcji wielowątkowych w systemie Unix 13. Monitory wprowadzenie i omówienie mechanizmu 14. Wykorzystanie monitorów w rozwiązywaniu typowych problemów przykłady 15. Zmienne warunkowe w systemie Unix, praktyczna implementacja procedur monitorowych 16. Porównanie i zestawienie semaforów z mechanizmami monitorowymi - podejście teoretyczne",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Znajomość podstaw programowania w języku C jest pomocna.",
        "lista_lektur": "Podstawowa lista lektur 1. Ben-Ari M.: Podstawy programowania współbieżnego, Wydawnictwa Naukowo Techniczne, Warszawa. 2. Colouris G., Dollimore J., Kindberg G.: Distributed Systems,Concepts and Design, second edition, Addison-Wesley. 3. Coulouris G., Dollimore J, Kindberg T.: Systemy rozproszone Podstawy i projektowanie, Wydawnictwa Naukowo Techniczne, Warszawa. 4. Hwang K., Briggs F.: Computer Architecture and Parallel Processing, McGraw - Hill. Uzupełniająca lista lektur 1. Lister A., Eager R.: Wprowadzenie do systemów operacyjnych, Wydawnictwa Naukowo Techniczne, Warszwa. 2. Silberschatz A., Gavlin P.: Podstawy systemów operacyjnych, Wydawnictwa Naukowo Techniczne, Warszwa. 3. Stevens R.: Unix Network Programming, Prentice Hall.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "373011.pdf"
    },
    {
        "nazwa_przedmiotu": "Big Data processing frameworks,",
        "kod_przedmiotu": "PG_00045325",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem przedmiotu jest wprowadzenie studentów w tematykę Big Data. W ramach przedmiotu omawiane są 3 nowoczesne frameworki umożliwiające łatwe pisanie aplikacji przetwarzających równolegle ogromne ilości danych na łatwo skalowalnych klastrach",
        "efekty_uczenia_sie": "[K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student potrafi wykorzystać framework Apache Spark oraz Hadoop do przetwarzania rozproszonego masowych danych oraz system HDFS do magazynowania masowych danych. [SU1] Ocena realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student zna wzorce przetwarzania rozproszonego Map-Reduce. [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student potrafi sformułować problem badawczy, zastosować odpowiednie metody, rozwiązać problem oraz poprawnie zinterpretować wyniki. Ponadto, student potrafi także krytycznie ocenić uzyskane wyniki. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym",
        "tresc_przedmiotu": "1. Wprowadzenie do Big Data i przetwarzania w chmurze 2. Platforma Apache Hadoop 3. Platforma Apache Storm 4. Platforma Apache Spark 5. Platforma Keras.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Programowanie w Javie i Pythonie",
        "lista_lektur": "Podstawowa lista lektur 1. http://hadoop.apache.org/ 2. http://storm.apache.org/ 3. http://spark.apache.org/ Uzupełniająca lista lektur 1. Hwang, K., Dongarra, J., Fox, G.: Distributed and Cloud Computing: From Parallel Processing to the Internet of Things. Morgan Kaufmann, 2011 2. Karau, H., Konwinski, A., Wendell, P., Zaharia, M.: Learning Spark: Lightning-Fast Big Data Analysis. O’Reilly, 2015 3. Erl, T., Puttini, R., Mahmood, Z.: Cloud Computing: Concepts, Technology, and Architecture. Prentice Hall, 2013 4. Miner, D., Shook, A.: MapReduce Design Patterns: Building Effective Algorithms and Analytics for Hadoop and Other Systems. O’Reilly, 2012",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "373012.pdf"
    },
    {
        "nazwa_przedmiotu": "Internship,",
        "kod_przedmiotu": "PG_00045273",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inteligentnych Systemów Interaktywnych",
        "cel_przedmiotu": "Cele praktyki są następujące:  zastosowanie w praktyce wiedzy i umiejętności zdobytych w trakcie dotychczasowych studiów, zdobycie nowej wiedzy, umiejętności praktycznych i kompetencji społecznych, poznanie przemysłowego środowiska pracy zespołowej oraz uwarunkowań i reguł obowiązujących w tym środowisku, kształtowanie właściwego stosunku do pracy w zespole: dbanie o jakość pracy, terminowość wykonywania zadań, prawidłowa współpraca z innymi osobami i komórkami w miejscu odbywania praktyki, rozwój własnej inicjatywy w środowisku pracy, nabycie umiejętności wydajnej pracy w zespole.",
        "efekty_uczenia_sie": "[K6_U03] wykazuje się profesjonalnym i efektywnym działaniem w ramach pracy zespołowej, zarówno w roli lidera, jak i członka zespołu Student potrafi pracować w firmie w zespole projektowym w różnych rolach, wykorzystując posiadaną wiedzę i umiejętności. [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów Student potrafi w firmie proponować różne rozwiązania stawianych problemów, analizować ich wady i zalety, zarówno pod kątem osiąganych rezultatów, jak i aspektów wytwórczych. [SW2] Ocena wiedzy zawartej w prezentacji [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 20.03.2025 08:38 Strona 2 z 3",
        "tresc_przedmiotu": "Plan praktyki musi zawierać co najmniej  trzy wybrane zadania z poniższego bloku umiejętności techniczno- inżynierskich:  1.Instalacja, konfiguracja i administracja niewielkich sieci komputerowych, w tym bezprzewodowych. 2.Implementacja polityki bezpieczeństwa informacji w firmie lub instytucji, instalacja ochrony antywirusowej, konfiguracja zapór ogniowych. 3.Instalacja, konfiguracja i administracja oprogramowania, w szczególności systemów operacyjnych i serwerów aplikacji. 4.Projektowanie, implementacja i modyfikacje oprogramowania w różnych technologiach i dla różnych zastosowań. 5.Testowanie oprogramowania, także z wykorzystaniem narzędzi do testowania automatycznego. 6.Wykorzystanie otwartych komponentów programowych z uwzględnieniem prawnych zależności pomiędzy nimi a produktem wynikowym. 7.Projektowanie i implementacja baz danych oraz badanie ich wydajności. 8.Posługiwanie się zaawansowanymi metodami i technologiami przetwarzania, składowania, transformacji i analizy danych (Big Data, Business Intelligence, hurtownie danych) 9.Projektowanie i prototypowanie zaawansowanych interfejsów użytkownika. 10. Posługiwanie się zaawansowanymi narzędziami informatycznymi do przetwarzania plików dźwiękowych, obrazów i wideo. 11. Konfiguracja urządzeń zewnętrznych komputera, rozbudowa i modyfikacja jego struktury modułów i urządzeń wewnętrznych. 12. Przygotowywanie i testowanie oprogramowania prostych mikrokontrolerów i systemów wbudowanych. 13. Przygotowywanie i analiza dokumentacji technicznej przedsięwzięć informatycznych, wykorzystanie modeli i narzędzi zarządzania dla e-biznesu.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 0.0",
        "wymagania_wstepne": " Student(ka) musi przed rozpoczęciem praktyk, w terminie wskazanym przez pełnomocnika dziekana ds. praktyk zawodowych dopełnić następujących formalności:  1. Zgłosić w sposób określony aktualnym regulaminem praktyk zamiar odbycia praktyki w wybranym przez siebie zakładzie  i uzyskać zgodę pełnomocnika dziekana ds. praktyk zawodowych. 2. W przypadkach wskazanych w aktualnie obowiązującym regulaminie praktyk uzyskać stosowną zgodę właściwego prodziekana i dostarczyć ją pełnomocnikowi dziekana ds. praktyk zawodowych. 3. W przypadku praktyki bezpłatnej uzyskać podpisaną umowę pomiędzy zakładem pracy i PG WETI oraz dostarczyć dane do ubezpieczenia NNW.",
        "lista_lektur": "Podstawowa lista lektur Nie ma zaleceń Uzupełniająca lista lektur Nie ma zaleceń",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "373013.pdf"
    },
    {
        "nazwa_przedmiotu": "Big Data analysis,",
        "kod_przedmiotu": "PG_00045382",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem kursu jest przedstawienie studentom metod przechowywania i analizy wielkich danych. Zagadnienie prezentowane jest od strony praktycznej, pokazywane są metody pozyskiwania, składowania i eksploracji wielkoskalowych zbiorów danych.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student potrafi zaprojektować, utworzyć i zainicjować wypełnianie składu danych, a także oszacować koszt przetwarzania. [SU1] Ocena realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student potrafi zaprojektować i przeprowadzić proces analizy wielkich danych z wykorzystanie odpowiednich algorytmów [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student zna charakterystyczne cechy przechowywania i przetwarzania danych w rozproszonych repozytoriach wielkoskalowych Student przedstawia zagadnienie pozyskiwania danych z dostępnych danych semistrukturalnych [SW1] Ocena wiedzy faktograficznej",
        "tresc_przedmiotu": "1. Charakterystyka wielkich danych 2. Otwarte powiązane dane 3. Pozyskiwanie wielkich danych 4. Roboty internetowe i analiza danych semistrukturalnych 5. Składowanie wielkich danych 6. Algorytmy eksploracji właściwe dla danych semistrukturalnych 7. Metody i narzędzia eksploracji wielkich danych",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Podstawowa wiedza na temat paradygmatu Map-Reduce",
        "lista_lektur": "Podstawowa lista lektur 1. Liu B., “Web data mining”, Springer, 2011 2. White T., “Hadoop, the definitive guide”, O’Reilly, 2012 3. George L., “HBase, the definitive guide”, O’Reilly, 2011 Uzupełniająca lista lektur brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "373014.pdf"
    },
    {
        "nazwa_przedmiotu": "Deep neural networks for data analysis,",
        "kod_przedmiotu": "PG_00053025",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Architektury Systemów Komputerowych",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów z metodami głębokiego uczenia maszynowego na potrzeby zaawansowanej analizy danych. Do typowych obszarów zastosowań tego typu metod należą: klasyfikacja obrazów, rozpoznawanie mowy czy rozumienie języka naturalnego.",
        "efekty_uczenia_sie": "[K6_W01] identyfikuje uwarunkowania procesów zachodzących w analizowanych systemach i dobiera metody ich rozwiązania, wykorzystując zgromadzoną wiedzę i uwzględniając wzajemne relacje między analizowanymi zjawiskami Na podstawie analizy problemu, dostępnych danych uczących, student potrafi dobrać odpowiednią architekturę głębokiej sieci neuronowej oraz algorytm uczenia tej sieci. [SW1] Ocena wiedzy faktograficznej [K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student wykorzystuje dostępne narzędzia do uczenia głębokiego do budowy, nauczenia i oceny działania zaprojektowanego modelu do rozwiązania zadanego problemu. [SU1] Ocena realizacji zadania [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Na podstawie analizy przebiegu treningów i innych uwarunkowań, student potrafi dobrać wartości hiperparametrów treningu oraz techniki regularyzacji w celu optymalizacji modelu. [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 12.02.2025 10:56 Strona 2 z 2",
        "tresc_przedmiotu": "1. Postawy uczenia maszynowego i sieci neuronowych 2. Analiza obrazów przy użyciu splotowych sieci neuronowych 3. Analiza sekwencji przy użyciu rekurencyjnych sieci neuronowych 4. Neuronowe modele języka naturalnego 5. Techniki poprawy generalizacji 6. Optymalizacja uczenia sieci 7. Praktyczne wskazówki dot. uczenia modeli głębokich",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 30.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Podstawowa wiedza z zakresu algebry liniowej i statystyki. Znajomość języka programowania Python.",
        "lista_lektur": "Podstawowa lista lektur Ian Goodfellow, Yoshua Bengio and Aaron Courville, Deep Learning, MIT Press, 2016, url: http://www.deeplearningbook.org/ Michael Nielsen, “Neural Networks and Deep Learning”, http:// neuralnetworksanddeeplearning.com/ Uzupełniająca lista lektur Andrew Ng, “Machine Learning Yearning”, http://www.mlyearning.org/ Tutorials on deep learning frameworks pages, such as: https:// www.tensorflow.org/tutorials, http://torch.ch/docs/tutorials.html",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Przedstaw architekturę splotowej sieci neuronowej, wskaż jej zalety względem sieci tradycyjnych oraz typowe zastosowania. W czasie rozwoju projektu wykorzystującego uczenie modelu głębokiego zaobserwowano zadowalający poziom błędu uczenia, ale wysoki poziomu błędu testowego. Co może być tego przyczyną? Rozważ kilka scenariuszy. Zaproponuj sposób poprawy.",
        "plik": "373015.pdf"
    },
    {
        "nazwa_przedmiotu": "Advanced data mining,",
        "kod_przedmiotu": "PG_00045380",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem przedmiotu jest wprowadzenie studentów w tematykę eksploracji oraz wizualizacji danych z użyciem języka Python.",
        "efekty_uczenia_sie": "[K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student potrafi wyciągać sensowne wnioski z analizowanych danych. Potrafi zastosować wiedzę z różnych dziedzin w celu wzbogacenia przeprowadzanej analizy. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Student potrafi czerpać wiedzę z różnych źródeł, w tym wiedzy z innych dziedzin nauki, w celu rozwiązania złożonych problemów analizy rzeczywistych danych. [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU1] Ocena realizacji zadania [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student potrafi dobrać odpowiednią metodę uczenia maszynowego do rozwiązania problemów eksploracji danych. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania  Data wygenerowania: 12.02.2025 10:57 Strona 2 z 2",
        "tresc_przedmiotu": "1. Wprowadzenie do języka Python  2. Przygotowywanie danych 3. Wizualizacja danych 4. Podstawowe modele predykcyjne 5. Model drzewa decyzyjnego 6. Dobór hiperparametrów modelu 7. Wykrywanie anomalii (grupowanie metodą K-means)",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Znajomość podstaw programowania oraz podstaw statystyki.",
        "lista_lektur": "Podstawowa lista lektur 1. Valentina Porcu, Python for Data Mining Quick Syntax Reference, Berkeley, CA : Apress : Imprint: Apress, 2018 2. Megan Squire, Mastering Data Mining with Python Find patterns hidden in your data, Packt Pub, 2016 3. Robert Layton, Learning data mining with Python: harness the power of Python to analyze data and create insightful predictive models, Packt Pub, 2015 Uzupełniająca lista lektur Greeneltch Nathan, Python Data Mining Quick Start Guide, Packt Pub  S.Ryza, U.Laserson, S.Owen & J.Wills,  Advanced Analytics with Spark (Spark. Zaawansowana analiza danych), ORelly (Helion) Karau, H., Konwinski, A., Wendell, P., Zaharia, M.: Learning Spark: Lightning-Fast Big Data Analysis. OReilly, 2015",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania W trakcie zajęć student dobierze optymalne hiperparametry modelu predykcyjnego.",
        "plik": "373016.pdf"
    },
    {
        "nazwa_przedmiotu": "Diploma thesis 2,",
        "kod_przedmiotu": "PG_00045315",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Prowadzenie studenta przez proces realizacji projektu dyplomowego, systematyczne monitorowanie postępów jego pracy przy realizacji projektu, udzielanie mu konsultacji, rad i wskazówek. Sprawdzenie praktycznych efektów projektu.",
        "efekty_uczenia_sie": "[K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów Student potrafi opracować swoje autorskie rozwiązanie problemu inżynierskiego, bazujące na istniejących narzędziach. [SW1] Ocena wiedzy faktograficznej [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Student wie, gdzie poszukiwać źródeł wiedzy na temat postawionego problemu i potrafi tę wiedzę zinterpretować stosownie do tego problemu. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu  Data wygenerowania: 12.02.2025 10:57 Strona 2 z 2",
        "tresc_przedmiotu": "1. Opracowanie dokumentacji projektowej 2. Realizacja produktu z jego weryfikacją i walidacją",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 45.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur   Regulamin dyplomowania na WETI PG (https://eti.pg.edu.pl/studenci/ dziekanat)  Uzupełniająca lista lektur brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   1. Napisanie dokumentacji projektowej 2. Implementacja, weryfikacja i walidacja produktu",
        "plik": "373018.pdf"
    },
    {
        "nazwa_przedmiotu": "Interactive visualisation,",
        "kod_przedmiotu": "PG_00045377",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Celem przedmiotu jest nabycie umiejętności konstruowania interaktywnego przekazu graficznego w komunikacji gospodarczej z pomocą narzędzi i rozwiązań informatycznych.",
        "efekty_uczenia_sie": "[K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student wie, skąd czerpać wiarygodne informacje, a tworząc prezentacje podaje źródło ich pochodzenia. [SW2] Ocena wiedzy zawartej w prezentacji [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym Student posiada wiedzę na temat zaawansowanych metod analizy i wizualizacji informacji biznesowych. [SW1] Ocena wiedzy faktograficznej [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Posiada umiejętność posługiwania się odpowiednio dobranymi metodami i narzędziami informatycznymi w celu prezentacji wyników swoich działań. [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU1] Ocena realizacji zadania",
        "tresc_przedmiotu": "Podstawy cyfrowej obróbki materiałów audiowizualnych.  Wizualizacja w diagnozie, ocenie i analizie zjawisk ekonomicznych. Zastosowania grafiki komputerowej w wizualizacji informacji. Dynamiczna prezentacja danych w wybranych zastosowaniach. Zaawansowane techniki wizualizacji w komunikacji wewnątrzorganizacyjnej.  Data wygenerowania: 11.04.2025 15:26 Strona 2 z 2",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Zaliczenie przedmiotu: Wizualizacja informacji ekonomicznej",
        "lista_lektur": "Podstawowa lista lektur Murray S., Interactive Data Visualization for the Web, 2nd Edition. O'Reilly Media' 2017  Bergström, B., Essentials of visual communication. Laurence King Pub. 2008 D. L. Adamy, Preparing and Delivering Effective Technical Presentations, Artech House Publishers, Boston - London, 2001. S. Bienvenu, The Presentation Skills Workshop, Amacom, New York, 2000. J. Kupsch, P. R. Graves, Here\"s How Create High-Impact Business Presentations, NTC/Contemporary Publishing Co., 1998. Rosenfeld L., Morville P.: Information Architecture for the World Wide Web: Designing Large-Scale Web Sites 3rd Edition, O'Reilly Media, 2007. Uzupełniająca lista lektur Austin, T., & Doust, R. (2007). New Media in Graphic Design. Harry N. Abrams, Inc",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania - wykonanie prezentacji audio, - wizualizacja wybranego projektu dotyczącego analizy danych, - interaktywna audiowizualna prezentacja wybranego tematu z zakresu kierunku studiów.",
        "plik": "373021.pdf"
    },
    {
        "nazwa_przedmiotu": "Investment strategies,",
        "kod_przedmiotu": "PG_00045379",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Finansów",
        "cel_przedmiotu": "Nabycie wiedzy i umiejętności w konstruowaniu strategii inwestycyjnych przy zastoswaniu wybranych narzędzi.",
        "efekty_uczenia_sie": "[K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Poznaje rzetelne źródła danych zawierające historyczne ceny transakcyjne. Identyfikuje ich przydatność do poznanych metod badawczych. [SW1] Ocena wiedzy faktograficznej [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Stosuje różnorodne kryteria konstrukcji portfela inwestycyjnego (strategie: minimalizacji ryzyka inwestycyjnego, maksymalizacja efektywności czy maksymalizacja stopy zwrotu). Łączy wiedzę z finansów korporacyjnych z wyborem odpowiedniej strategii inwestycyjnej. [SK2] Ocena postępów pracy [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów Konstruuje optymalny portfel inwestycyjny wg teorii Markowitza. Ocenia efektywność inwestycji na podstawie współczynnika Beta i Alfy Jensena. Konstruuje strategię w oparciu o analizę zdarzeń. [SU1] Ocena realizacji zadania  Data wygenerowania: 20.03.2025 08:43 Strona 2 z 2",
        "tresc_przedmiotu": "Podstawowy i złożony obszar analizy inwestycyjnej.  Ryzyko i zwrot z inwestycji - metody pomiaru; Teoria budowy portfela inwestycyjnego; Pomiar efektywności inwestycji; Analiza zdarzeń i jej zastosowanie w konstruowaniu strategii inwestycyjnej; Instrumenty pochodne w kształtowaniu strategii inwestycyjnej.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Zarządzanie finansami",
        "lista_lektur": "Podstawowa lista lektur Scott B. Smart, Lawrence J. Gitman, Michael D. Joehnk, Fundamentals of Investing, Essex 2016.  Elton E.J., M.J. Gruber, S.J Brown, W.N. Goetzmann, Modern portfolio theory and investment analysis, Wiley 2017. Damodaran A., Investment Philosophies: Successful Strategies and the Investors Who Made Them Work, 2nd Edition, Wiley 2012. Uzupełniająca lista lektur Miner R., High Probability Trading Strategies: Entry to Exit Tactics for the Forex, Futures, and Stock Markets, Wiley 2008.  Kufel T., Ekonometria. Rozwiązywanie problemów z wykorzystaniem programu GRETL, PWN, Warszawa 2013. Luszniewicz A., Słaby T., Statystyka z pakietem komputerowym STATISTICA PL, C.H.Beck, Warszawa 2008. Sharpe W. 1992. Asset allocation: management style and performance measurement. Journal of Portfolio Management 18, 719 (Article). Agarwal V., N. Y. Naik. 2004. Risks and portfolio decisions involving hedge funds. Review of Financial Studies 17, 63-98 (Article).",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania Konstrukcja optymalnego portfela inwestycyjnego.  Wybór strategii inwestycyjnej w oparciu o zadane kryteria.",
        "plik": "373022.pdf"
    },
    {
        "nazwa_przedmiotu": "Diploma seminar,",
        "kod_przedmiotu": "PG_00045368",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Przygotowanie studenta do napisania inżynierskiej pracy dyplomowej w zakresie merytorycznym (wyszukiwanie literatury, formułowanie problemu, gromadzenia danych, dobór metod rozwiązania, interpretacja wyników) oraz formalnym (przygotowanie tekstu pracy zgodnie z obowiązującymi zasadami).",
        "efekty_uczenia_sie": "[K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów krytycznie ocenia przydatność pozyskanej wiedzy do realizacji celów tworzonej pracy dyplomowej [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW1] Ocena wiedzy faktograficznej [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją opracowuje i prezentuje wyniki swoich badań w ramach tworzonego projektu dyplomowego [SU1] Ocena realizacji zadania [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji [K6_K01] wykazuje się świadomością kwestii prawnych, etycznych i różnorodności kulturowej, podejmując społecznie odpowiedzialne decyzje przestrzega praw autorskich podczas pisania pracy dyplomowej [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [SK2] Ocena postępów pracy [SK3] Ocena umiejętności organizacji pracy [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej  Data wygenerowania: 17.03.2025 21:54 Strona 2 z 3",
        "tresc_przedmiotu": "Formalne aspekty przygotowania pracy dyplomowej. Sformułowanie problemu badawczego. Wyszukiwanie i analiza literatury przedmiotu. Gromadzenie danych z różnych źródeł: badania ankietowe, obserwacje, dane statystyczne, dokumentacja. Dobór metody rozwiązania problemu. Rozwiązanie problemu i interpretacja wyników. Wnioski potwierdzające rozwiązanie problemu.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 30.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " uzyskanie wpisu na semestr dyplomowy",
        "lista_lektur": "Podstawowa lista lektur lista lektur właściwa dla specyfiki pracy dyplomowej Uzupełniająca lista lektur brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   Formalne aspekty przygotowania pracy dyplomowej. Sformułowanie problemu badawczego. Wyszukiwanie i analiza literatury przedmiotu. Gromadzenie danych z różnych źródeł: badania ankietowe, obserwacje, dane statystyczne, dokumentacja. Dobór metody rozwiązania problemu. Rozwiązanie problemu i interpretacja wyników. Wnioski potwierdzające rozwiązanie problemu. Napisanie pracy. Przygotowanie prezentacji do obrony.",
        "plik": "373023.pdf"
    },
    {
        "nazwa_przedmiotu": "Internship,",
        "kod_przedmiotu": "PG_00045273",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inteligentnych Systemów Interaktywnych",
        "cel_przedmiotu": "Cele praktyki są następujące:  zastosowanie w praktyce wiedzy i umiejętności zdobytych w trakcie dotychczasowych studiów, zdobycie nowej wiedzy, umiejętności praktycznych i kompetencji społecznych, poznanie przemysłowego środowiska pracy zespołowej oraz uwarunkowań i reguł obowiązujących w tym środowisku, kształtowanie właściwego stosunku do pracy w zespole: dbanie o jakość pracy, terminowość wykonywania zadań, prawidłowa współpraca z innymi osobami i komórkami w miejscu odbywania praktyki, rozwój własnej inicjatywy w środowisku pracy, nabycie umiejętności wydajnej pracy w zespole.",
        "efekty_uczenia_sie": "[K6_U03] wykazuje się profesjonalnym i efektywnym działaniem w ramach pracy zespołowej, zarówno w roli lidera, jak i członka zespołu Student potrafi pracować w firmie w zespole projektowym w różnych rolach, wykorzystując posiadaną wiedzę i umiejętności. [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów Student potrafi w firmie proponować różne rozwiązania stawianych problemów, analizować ich wady i zalety, zarówno pod kątem osiąganych rezultatów, jak i aspektów wytwórczych. [SW2] Ocena wiedzy zawartej w prezentacji [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 20.03.2025 08:39 Strona 2 z 3",
        "tresc_przedmiotu": "Plan praktyki musi zawierać co najmniej  trzy wybrane zadania z poniższego bloku umiejętności techniczno- inżynierskich:  1.Instalacja, konfiguracja i administracja niewielkich sieci komputerowych, w tym bezprzewodowych. 2.Implementacja polityki bezpieczeństwa informacji w firmie lub instytucji, instalacja ochrony antywirusowej, konfiguracja zapór ogniowych. 3.Instalacja, konfiguracja i administracja oprogramowania, w szczególności systemów operacyjnych i serwerów aplikacji. 4.Projektowanie, implementacja i modyfikacje oprogramowania w różnych technologiach i dla różnych zastosowań. 5.Testowanie oprogramowania, także z wykorzystaniem narzędzi do testowania automatycznego. 6.Wykorzystanie otwartych komponentów programowych z uwzględnieniem prawnych zależności pomiędzy nimi a produktem wynikowym. 7.Projektowanie i implementacja baz danych oraz badanie ich wydajności. 8.Posługiwanie się zaawansowanymi metodami i technologiami przetwarzania, składowania, transformacji i analizy danych (Big Data, Business Intelligence, hurtownie danych) 9.Projektowanie i prototypowanie zaawansowanych interfejsów użytkownika. 10. Posługiwanie się zaawansowanymi narzędziami informatycznymi do przetwarzania plików dźwiękowych, obrazów i wideo. 11. Konfiguracja urządzeń zewnętrznych komputera, rozbudowa i modyfikacja jego struktury modułów i urządzeń wewnętrznych. 12. Przygotowywanie i testowanie oprogramowania prostych mikrokontrolerów i systemów wbudowanych. 13. Przygotowywanie i analiza dokumentacji technicznej przedsięwzięć informatycznych, wykorzystanie modeli i narzędzi zarządzania dla e-biznesu.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 0.0",
        "wymagania_wstepne": " Student(ka) musi przed rozpoczęciem praktyk, w terminie wskazanym przez pełnomocnika dziekana ds. praktyk zawodowych dopełnić następujących formalności:  1. Zgłosić w sposób określony aktualnym regulaminem praktyk zamiar odbycia praktyki w wybranym przez siebie zakładzie  i uzyskać zgodę pełnomocnika dziekana ds. praktyk zawodowych. 2. W przypadkach wskazanych w aktualnie obowiązującym regulaminie praktyk uzyskać stosowną zgodę właściwego prodziekana i dostarczyć ją pełnomocnikowi dziekana ds. praktyk zawodowych. 3. W przypadku praktyki bezpłatnej uzyskać podpisaną umowę pomiędzy zakładem pracy i PG WETI oraz dostarczyć dane do ubezpieczenia NNW.",
        "lista_lektur": "Podstawowa lista lektur Nie ma zaleceń Uzupełniająca lista lektur Nie ma zaleceń",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania",
        "plik": "373025.pdf"
    },
    {
        "nazwa_przedmiotu": "Diploma thesis 2,",
        "kod_przedmiotu": "PG_00045315",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2027/2028",
        "rok": "4",
        "semestr": "7",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Przygotowanie studenta do napisania inżynierskiej pracy dyplomowej w zakresie merytorycznym (wyszukiwanie literatury, formułowanie problemu, gromadzenia danych, dobór metod rozwiązania, interpretacja wyników) oraz formalnym (przygotowanie tekstu pracy zgodnie z obowiązującymi zasadami).",
        "efekty_uczenia_sie": "[K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów kreatywnie formułuje i realizuje cele tworzonej pracy dyplomowej [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW1] Ocena wiedzy faktograficznej [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów zdobywa wiedzę potrzebną do realizacji celów pisanej pracy dyplomowej [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU2] Ocena umiejętności analizy informacji  Data wygenerowania: 17.03.2025 21:55 Strona 2 z 3",
        "tresc_przedmiotu": "Formalne aspekty przygotowania pracy dyplomowej. Sformułowanie problemu badawczego. Wyszukiwanie i analiza literatury przedmiotu. Gromadzenie danych z różnych źródeł: badania ankietowe, obserwacje, dane statystyczne, dokumentacja. Dobór metody rozwiązania problemu. Rozwiązanie problemu i interpretacja wyników. Wnioski potwierdzające rozwiązanie problemu.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 45.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " uzyskanie wpisu na semestr dyplomowy",
        "lista_lektur": "Podstawowa lista lektur lista lektur właściwa dla specyfiki pracy dyplomowej Uzupełniająca lista lektur brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   Formalne aspekty przygotowania pracy dyplomowej. Sformułowanie problemu badawczego. Wyszukiwanie i analiza literatury przedmiotu. Gromadzenie danych z różnych źródeł: badania ankietowe, obserwacje, dane statystyczne, dokumentacja. Dobór metody rozwiązania problemu. Rozwiązanie problemu i interpretacja wyników. Wnioski potwierdzające rozwiązanie problemu. Napisanie pracy. Przygotowanie prezentacji do obrony.",
        "plik": "373026.pdf"
    },
    {
        "nazwa_przedmiotu": "Diploma thesis 1,",
        "kod_przedmiotu": "PG_00045314",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Przygotowanie studenta do napisania inżynierskiej pracy dyplomowej w zakresie merytorycznym(wyszukiwanie literatury, formułowanie problemu, gromadzenia danych, dobór metod rozwiązania, interpretacja wyników)oraz formalnym (przygotowanie tekstu pracy zgodnie z obowiązującymi zasadami).",
        "efekty_uczenia_sie": "[K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji wykorzystuje swoją zdolność do analitycznego myślenia w celu realizacji projektu dyplomowego [SK2] Ocena postępów pracy [SK3] Ocena umiejętności organizacji pracy [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_U06] zdobywa nową wiedzę, planując własny rozwój sprzyjający osiąganiu wyznaczonych celów zdobywa wiedzę potrzebną do realizacji celów pisanej pracy dyplomowej [SU2] Ocena umiejętności analizy informacji [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W04] wykazuje się kreatywnym i przedsiębiorczym działaniem w formułowaniu i realizowaniu innowacyjnych pomysłów kreatywnie formułuje i realizuje cele tworzonej pracy dyplomowej [SW1] Ocena wiedzy faktograficznej [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 17.03.2025 21:53 Strona 2 z 2",
        "tresc_przedmiotu": "Formalne aspekty przygotowania pracy dyplomowej. Sformułowanie problemu badawczego. Wyszukiwanie i analiza literatury przedmiotu. Gromadzenie danych z różnych źródeł: badania ankietowe, obserwacje, dane statystyczne, dokumentacja. Dobór metody rozwiązania problemu. Rozwiązanie problemu i interpretacja wyników. Wnioski potwierdzające rozwiązanie problemu.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 0.0 Laboratorium: 0.0 Projekt: 15.0 Seminarium: 0.0 RAZEM: 15.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur lista lektur właściwa dla specyfiki pracy dyplomowej Uzupełniająca lista lektur brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania określenie celu pracy dyplomowej  wybór metod i narzędzi badawczych",
        "plik": "373029.pdf"
    },
    {
        "nazwa_przedmiotu": "E-marketing and trend analysis,",
        "kod_przedmiotu": "PG_00045374",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Marketingu",
        "cel_przedmiotu": "Zapoznanie się z wiedzą z zakresu e-marketingu, rozwój umiejętności w zakresie zarządzania marketingowego, a w szczególności formułowania strategii marketingowej i programów marketingowych.",
        "efekty_uczenia_sie": "[K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student krytycznie analizuje trendy rynkowe i strategie e- marketingowe, integrując wiedzę z obszaru marketingu, zachowania konsumentów, analizy danych i technologii cyfrowych w celu podejmowania trafnych decyzji biznesowych. [SK1] Ocena umiejętności pracy w grupie [SK4] Ocena umiejętności komunikacji, w tym poprawności językowej [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [SK2] Ocena postępów pracy [K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student wykorzystuje zaawansowane narzędzia analityczne i techniki przetwarzania danych do identyfikacji trendów rynkowych oraz projektowania innowacyjnych strategii e-marketingowych. [SU2] Ocena umiejętności analizy informacji [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU1] Ocena realizacji zadania [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student potrafi analizować źródła danych dotyczących trendów rynkowych i e-marketingu oraz oceniać ich wiarygodność i przydatność w procesie podejmowania decyzji marketingowych. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW1] Ocena wiedzy faktograficznej  Data wygenerowania: 11.04.2025 15:20 Strona 2 z 2",
        "tresc_przedmiotu": "WYKŁADY  Wprowadzenie do marketingu elektronicznego i ewolucji marketingu-mixu. Modele cyfrowe i przewaga konkurencyjna. Cyfrowe programy marketingowe i plan marketingowy. Kupowanie, posiadanie, bycie. Osobowość, psychografia i jaźń. Postrzeganie, uczenie się i pamięć klienta. Motywacja, wartości i zaangażowanie klienta. Klienci i ich zachowania. Postawy, ich zmiana i interaktywna komunikacja. Marketing mediów społecznościowych. Doświadczenia klientów. Budowanie ruchu w Internecie. Zintegrowane strategie kontaktu z klientami. Trendy w marketingu cyfrowym, których nie możemy zignorować. LABORATORIA Określenie typu serwisu internetowego oraz jego oferty. Przeprowadzenie badań marketingowych oceniających nowy serwis internetowy i aplikację. Określenie misji, wizji, wartości oraz celów działania witryny. Określenie grup odbiorców i działań, jakie będą podejmować na stronach serwisu. Analiza konkurencji. Analiza dostawców. Model biznesowy Canvas. Analiza TOWS/SWOT. Określenie strategii działania witryny. Opracowanie schematu działania witryny i aplikacji. Opracowanie mapy witryny. Podsumowanie koncepcji strategii marketingowej - SOSTAC.",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Marketing, Badania marketingowe",
        "lista_lektur": "Podstawowa lista lektur   • Strauss J. & Frost R. (2014). E-marketing. 7th International Edition. Pearson Education. • Solomon, M. R., Askegaard, S., Hogg, M. K., & Bamossy, G. J. (2019). Consumer Behaviour: A European Perspective. Pearson Education.  Uzupełniająca lista lektur   • Evans D. (2010). Social Media Marketing. Wiley Publishing Inc. • Stokes R. (2013). E-marketing. 5th edition. Quirk Education Pty (Ltd).",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   • Wyjaśnić znaczenie e-marketingu we współczesnej firmie. • Sformułowanie zintegrowanego i kompleksowego planu e-marketingu. • Wyjaśnić i zilustrować wykorzystanie search engine marketing. • Wyjaśnić znaczenie prosumentów w działalności marketingowej organizacji.",
        "plik": "373030.pdf"
    },
    {
        "nazwa_przedmiotu": "Digital Business,",
        "kod_przedmiotu": "PG_00053098",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "6",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "To know about digital business and digital commerce  To be aware of opportunities and barriers of digital business To learn how to assess digital technologies that can be used in the supply chain in various domains To assess the characteristics of digital start-ups To know the main elements of a digital business strategy To learn how to define a digital business strategy",
        "efekty_uczenia_sie": "[K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji A student is able to make logical connections between the theoretical part of the course and practical lab activities. [SK1] Ocena umiejętności pracy w grupie [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją A student is able to present convincingly professional presentations of the results of undertaken activities, with their advanced interpretation. [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym A student is able to observe, analyse and design a digital business strategy. [SW1] Ocena wiedzy faktograficznej [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW2] Ocena wiedzy zawartej w prezentacji",
        "tresc_przedmiotu": "UNIT 1 - Digital business and digital commerce  UNIT 2 - Opportunities and barriers of a digital business UNIT 3 - Digital markets and digital goods UNIT 4 - Digital start-ups UNIT 5 - Digital business strategy - concepts and definition UNIT 6 - Digital business strategy - formulation and implementation UNIT 7 - Communication in (and of) digital business",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur Laudon K.C., Traver C.G. (2014) E-commerce Business, technology, society. Pearson 2014.  Sikorski M. (2012). Usługi on-line. Jakość, interakcje, satysfakcja klienta. Wyd. PJWSTK Warszawa. Dutko M. (2013). E-biznes. Poradnik praktyka. Helion.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania The exam happens online and lasts for 1 h. The students will have ten questions to answer. Among them three questions are the same for all the students, while other seven are randomly assigned from the existing pool of 80+ questions.  Below you can find the examples of the questions: - Please define the digital value proposition. Exemplify it with a company of your choice. - Name 3 barriers for technology adoption by businesses and 3 barriers by consumers. Choose one per each category and explain in detail.",
        "plik": "373031.pdf"
    },
    {
        "nazwa_przedmiotu": "Informatization strategies,",
        "kod_przedmiotu": "PG_00045371",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Przygotowanie do opracowania strategii informatyzacji: analiza stanu istniejącego oraz stanu pożądanego, jak również działań służących do realizacji jej celów dla wybranego procesu.",
        "efekty_uczenia_sie": "[K6_W03] identyfikuje wiarygodne źródła informacji istotne dla analizowanych zagadnień Student posiada wiedzę na temat doboru elementów technologii informatycznej dla potrzeb realizacji strategii IT. [SW1] Ocena wiedzy faktograficznej [K6_U02] przygotowuje i przedstawia w sposób przekonujący profesjonalne prezentacje wyników swoich działań, z ich zaawansowaną interpretacją Student posiada umiejętności posługiwania się wybranymi metodami i narzędziami do przygotowania i implementowania strategii IT. [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_K02] podejmuje kompetentne i etyczne decyzje w celu tworzenia i utrzymania wartości ekonomicznych, społecznych i środowiskowych Student potrafi dobrać strategię informatyzacji do zadań realizowanych w przedsiębiorstwie [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce",
        "tresc_przedmiotu": "• Definicja strategii informatyzacji, • Zgodność strategii organizacji i IT, • Proces formułowania strategii informatyzacji, • Narzędzia i metody stosowane w strategii IT: analiza AS-IS, SWOT, definicja TO-BE, IT BSC, definicja celów SMART, IT KPI, • Komunikacja i wprowadzanie zmian, • Definiowanie priorytetów IT, • Wdrażanie narzędzi monitorujących, • Ramy architektury korporacyjnej, • Wdrożenie architektury korporacyjnej (TOGAF), • Zarządzanie ryzykiem w strategii IT.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 15.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Podstawy informatyki",
        "lista_lektur": "Podstawowa lista lektur • Albeladi K.S., Khan U.A., Khan P.M. (2014). Driving business value through effective IT strategy development. 2014 International Conference on Computing for Sustainable Global Development (INDIACom); https://ieeexplore.ieee.org/document/6828021. • Chen D.Q., Mocker M., Preston D.S., Teubner A. (2010). Information systems strategy: reconceptualization, measurement, and implications, MIS Quarterly, 34(2), 233259, • de Souza Bermejo P.H., Olímpio Tonelli A., Zambalde A.L., Leomar Todesco J. (2014). Towards an understanding of information technology strategy development based on knowledge management. Revista de Ciências Da Administração, 16(40), 139155. • Drive Performance, Harvard Business Review (JanuaryFebruary 1992), ISSN 0017-8012, Retrieved 2020-01-15. • Galliers, R. D., Leidner, D. E., & Simeonova, B. (Eds.). (2020). Strategic information management: Theory and practice. Routledge. • Materiały udostępnione na  eKursie. Uzupełniająca lista lektur • TOGAF framework, https://pubs.opengroup.org/architecture/togaf9- doc/arch/index.html. • ArchiMate, https://www.archimatetool.com/",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania • Przygotowanie strategii IT dostosowanej do strategii organizacji, • Analiza wpływu IT na efektywność firmy • Projekt wizji docelowej IT z wykorzystaniem BSC (Balanced Score Card), • Definicja celów strategicznych SMART • Projekt monitoringu i KPI dla obszaru IT",
        "plik": "373032.pdf"
    },
    {
        "nazwa_przedmiotu": "Enterprise Information Systems,",
        "kod_przedmiotu": "PG_00053097",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Informatyki w Zarządzaniu",
        "cel_przedmiotu": "Celem przedmiotu jest wprowadzenie do teorii i praktyki stosowania technologii i systemów informatycznych przez organizacje dla osiągania celów strategicznych i realizacji transformacji cyfrowej.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych potrafi wybierać systemy informatyczne odpowiednie do zastosowań biznesowych [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym wie jak przepływy informacji w przedsiębiorstwie wspierają procesy biznesowe [SW1] Ocena wiedzy faktograficznej [K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów wie jak stosować systemy informatyczne do rozwiązywania problemów biznesowych, z jakimi boryka się przedsiębiorstwo [SW1] Ocena wiedzy faktograficznej",
        "tresc_przedmiotu": "WYKŁADY  Wprowadzenie - przedsiębiorstwo cyfrowe Typologia - rodzaje systemów informatycznych przedsiębiorstw Organizacja - wzajemny wpływ organizacji na systemy informatyczne i systemów na organizacje LABORATORIUM  Wykorzystanie systemu SAP w działalności organizacji, moduły: Sprzedaż i dystrybucja, Zarządzanie materiałami,  Planowanie i realizacja produkcji, oraz Rachunkowość finansowa należności",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": "",
        "lista_lektur": "Podstawowa lista lektur Kenneth C. Laudon and Jane P. Laudon. (2022). Management information systems: Managing the digital firm. 17th edition. Pearson Education.  Introduction to SAP S/4HANA. Next Generation Business Suite, Last Update: July 2023, ©2023 SAP SE / SAP UCC Magdeburg Uzupełniająca lista lektur Erik Brynjolfsson, Andrew McAfee. The Second Machine Age - Work, Progress, and Prosperity in a Time of Brilliant Technologies. Norton. 2016",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania   Jakie są cele strategiczne systemów informatycznych przedsiębiorstw?W jaki sposób system informacyjny realizuje wartość dla przedsiębiorstwa?Jakie dyscypliny badają systemy informacyjne i co każda z nich wnosi?W jaki sposób procesy biznesowe są powiązane z systemami informatycznymi?Jak systemy informatyczne łączą i poprawiają efektywność przedsiębiorstwa?Jaka jest rola funkcji systemów informatycznych w przedsiębiorstwie?Jak organizacja wpływa na tworzenie i użytkowanie systemów informatycznych?Jak systemy informatyczne wpływają na funkcjonowanie organizacji?",
        "plik": "373033.pdf"
    },
    {
        "nazwa_przedmiotu": "Business process analysis and optimization,",
        "kod_przedmiotu": "PG_00045372",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Zarządzania i Ekonomii -> Katedra Zarządzania",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów z podstawami modelowania procesów biznesowych z wykorzystaniem standardowych notacji, ich analiza oraz optymalizacja.",
        "efekty_uczenia_sie": "[K6_U01] analizuje i ocenia złożone procesy w kontekście możliwości ich doskonalenia, wykorzystując zróżnicowane metody, w tym analityczne i symulacyjne Student potrafi dokonać analizy wybranego procesu wykorzystując metody symulacyjne i rekomenduje kierunek usprawnień. [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym Student posiada wiedzę umożliwiającą analizę wybranego procesu biznesowego z uwzględnieniem kontekstu. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Student wie skąd pozyskać wiedzę, aby dokonać analizy wybranego procesu biznesowego. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 11.04.2025 15:09 Strona 2 z 3",
        "tresc_przedmiotu": "WYKŁAD:  Podstawowe pojęcia i definicje dotyczące analizy i optymalizacji procesów. Architektura procesów - referencyjny model klasyfikacji procesów (PCF) + przykład. Narzędzia no-code. Ilościowa analiza procesów +przykład. Jakościowa analiza procesów +przykład. Kokpit menedżerski / analityczny +przykład. Metody usprawniania i optymalizacji procesów + przykład. Big data i analiza procesu +przykład. Cele biznesowe i narzędzia automatyzacji procesów. Wdrażanie automatyzacji procesów.  Projektowanie czynności i modeli danych w procesach. Reguły decyzyjne i ich implementacja. Integracja z innymi systemami.  LABORATORIUM: Kreatywna obserwacja rzeczywistości celem identyfikacji procesów, których student jest interesariuszem, wykonawcą, bądź właścicielem. Samodzielna budowa modelu symulacyjnego z wykorzystaniem programu iGrafx i notacji BPMN, na podstawie umiejętności nabytych w semestrze poprzedzającym w ramach przedmiotu Modelowanie procesów biznesowych. Przeprowadzanie symulacji, testów i analiz celem optymalizacji procesu. Wykonanie opisu procesu. Obrona zrealizowanego zadania. Przygotowanie modelu i dokumentacji  procesu z wykorzystaniem narzędzia no-code.",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Ukończony przedmiot \"Modelowanie procesów biznesowych\".",
        "lista_lektur": "Podstawowa lista lektur Dumas M., La Rosa M., Mendling J., Reijers H.A. (2013, 2018), Fundamentals of Business Process Management, Springer-Verlag GmbH Germany vom Brocke J., Rosemann M. (eds.) (2015): Handbook on Business Process Management 1, Springer- Heidelberg New York Dordrecht London vom Brocke J., Rosemann M. (eds.) (2015): Handbook on Business Process Management 2, Springer- Heidelberg New York Dordrecht London Uzupełniająca lista lektur Drejewicz Sz., Zrozumieć BPMN. Modelowanie procesów biznesowych, Wydawnictwo Helion, Gliwice 2012.  Piotrowski M., Procesy biznesowe w praktyce. Projektowanie, testowanie i optymalizacja, Wydawnictwo Helion, Gliwice 2013. Gawin B., Marcinkowski B., Symulacja procesów biznesowych. Standardy BPMS i BPMN w praktyce , Wydawnictwo Helion, Gliwice 2014. Gawin B., Systemy informatyczne w zarządzaniu procesami Workflow, Wydawnictwo Naukowe PWN, Warszawa 2015. Misiak Z.: Modelowanie procesów biznesowych. BPMN 2.0 od podstaw, Onepress, 2023 Research and theory papers",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1) Wskaż obszary zastosowania analizy procesów biznesowych. 2) Wskaż sposoby usprawniania procesu biznesowego. Podaj przykłady 3) Omów zastosowanie kokpitu menedżerskiego do analizy procesu biznesowego",
        "plik": "373036.pdf"
    },
    {
        "nazwa_przedmiotu": "Nonrelational databases,",
        "kod_przedmiotu": "PG_00064003",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "polski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem kursu jest przedstawienie studentom podstawowych typów nierelacyjnych baz danych.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student potrafi zaprojektować, zgodnie z zadaną specyfikacją (w oparciu o scenariusze wykorzystania i zapytania kompetencyjne wynikające z zastosowań biznesowych) bazę dokumentową, grafową ora typu klucz-wartość. Ponadto, student potrafi formułować i wykonywać zapytania w językach (formułach/ funkcjach) specyficznych dla danego typu bazy nierelacyjnej. [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU1] Ocena realizacji zadania [K6_W07] analizuje w zaawansowany sposób procesy biznesowe w kontekście technicznym, prawnym, ekonomicznym, finansowym i społecznym Student potrafi dobrać właściwy typ bazy nierelacyjnej do konkretnego zastosowania biznesowego. [SW1] Ocena wiedzy faktograficznej [K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Student potrafi załadować dane do nierelacyjnej bazy danych. [SW2] Ocena wiedzy zawartej w prezentacji [SW1] Ocena wiedzy faktograficznej",
        "tresc_przedmiotu": "1. Wprowadzenie do baz danych NoSQL- rodzaje baz danych NoSQL- wprowadzenie do rozproszonych baz danych- CAP- BASE2. Dokumentowe bazy danych - MongoDB3. Bazy danych klucz-wartość - Redis4. Grafowe bazy danych - Neo4J",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 30.0 Seminarium: 0.0 RAZEM: 75.0",
        "wymagania_wstepne": " Znajomość baz danych.",
        "lista_lektur": "Podstawowa lista lektur 1. Professional NoSQL, Shashanki Tiwari, Wiley, 2011. 2. MongDB, The Definitive Guide, Kristina Chodorow, O'Reilly, 2013 3. 3. Graph Databases: New Opportunities for Connected Data, Ian Robinson and Jim Webber, O'Reilly 2015. Uzupełniająca lista lektur Dokumentacja baz nierelacyjnych.",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Zamodeluj bazę danych NoSQL (typu klucz-wartość, dokumentową, grafową)2. Zdefiniuj i wykonaj zapytania",
        "plik": "373726.pdf"
    },
    {
        "nazwa_przedmiotu": "Frameworks and tools for data engineers,",
        "kod_przedmiotu": "PG_00064004",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studentów z metodykami prowadzenia projektów oraz metodami i narzędziami wspierającymi organizację pracy w ramach tych projektów.",
        "efekty_uczenia_sie": "[K6_W02] demonstruje zaawansowane przygotowanie w zakresie metod oraz technik formułowania i rozwiązywania problemów Student demonstruje zaawansowane przygotowanie w zakresie doboru metodyki prowadzenia projektu oraz metod i narzędzi wspierających organizację projektu. Dodatkowo, student formułuje zagadnienia problemowe niezbędne do spełnienia założonych celów projektu. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [SW2] Ocena wiedzy zawartej w prezentacji [SW1] Ocena wiedzy faktograficznej [K6_U03] wykazuje się profesjonalnym i efektywnym działaniem w ramach pracy zespołowej, zarówno w roli lidera, jak i członka zespołu Student potrafi działać w zespole pełniąc konkretne role zdefiniowane dla wybranej metodyki prowadzenia projektu. Student potrafi również korzystać z narzędzi i metod wspierających organizację pracy w projekcie. [SU1] Ocena realizacji zadania [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU5] Ocena umiejętności zaprezentowania wyników realizacji zadania [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student potrafi podjąć decyzje dotyczące metodyki pracy, metod i używanych narzędzi w celu wytworzenia produktu wymaganego w projekcie. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce [SK3] Ocena umiejętności organizacji pracy [SK1] Ocena umiejętności pracy w grupie [SK2] Ocena postępów pracy",
        "tresc_przedmiotu": "1. Wprowadzenie do metodyk lekkich  2. Prowadzenie projektów w metodyce Scrum 3. Zastosowanie narzędzi wersjonowania kodu 4. Ciągła integracja 5. Ciągłe wdrażanie 6. Wirtualizacja/konteneryzacja",
        "formy_zajec": "Wykład: 30.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 60.0",
        "wymagania_wstepne": " Umiejętność programowania w przynajmniej jednym języku.",
        "lista_lektur": "Podstawowa lista lektur Nigel Poulton, Docker Deep Dive: Zero to Docker in a single book, 2024 edition,  Stephanie Ockerman, Simon Reindl, Mastering Professional Scrum: A Practitioners Guide to Overcoming Challenges and Maximizing the Benefits of Agility (The Professional Scrum Series) 1st Edition Jean-Marcel Belmont, Hands-On Continuous Integration and Delivery, 2018 Uzupełniająca lista lektur Brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Przygotuj Product Backlog używając wybranego narzędzia.  2. Utwórz i skonfiguruj repozytorium kodu w wybranym narzędziu Git 3. Zdefiniuj politykę zarządzania branchami 4. Skonfiguruj CI/CD",
        "plik": "373728.pdf"
    },
    {
        "nazwa_przedmiotu": "Databases,",
        "kod_przedmiotu": "PG_00064005",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "3",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydziały Politechniki Gdańskiej -> Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studenta z funkcjami systemów zarządzania bazami danych, z zasadami projektowania relacyjnych baz danych oraz z formułowaniem zapytań w języku SQL.",
        "efekty_uczenia_sie": "[K6_U07] wykorzystuje technologie informatyczne w celu usprawnienia pozyskiwania, analizy i przetwarzania danych w zastosowaniach biznesowych Student potrafi zrealizować zadanie polegające na utworzeniu relacyjnej bazy danych oraz na sformułowaniu zapytań o różnym stopniu złożoności. [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [SU1] Ocena realizacji zadania [K6_U04] formułuje logiczne rozwiązania złożonych lub nieustrukturyzowanych problemów Student potrafi dokonać analizy rzeczywistego złożonego systemu, zdefiniować ograniczenia i założenia  w kontekście utworzenia bazy danych. [SU2] Ocena umiejętności analizy informacji [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W06] klasyfikuje pozyskiwane informacje, oceniając ich przydatność do rozwiązania sformułowanych problemów Student potrafi zebrać informacje, odpowiednio je sklasyfikować i utworzyć model systemu zgodnie z metodologią ERM. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym  Data wygenerowania: 29.09.2025 16:29 Strona 2 z 3",
        "tresc_przedmiotu": "1. Architektura systemu baz danych  2. Funkcje systemu zarządzania bazami danych 3. Zbiory encji, atrybuty encji, klucze encji, związki 4. Diagram związków encji (ERD) - koncepcja, pojęcia ogólne 5. Tworzenie diagramów związków encji 6. Relacyjna baza danych definicje, zasady integralnościowe 7. Przejście od diagramu związków encji na schemat relacyjnej bazy danych 8. Podstawy algebry relacji 9. Język SQL przegląd, źródła, standardy 10. Tworzenie tablic i wstawianie danych 11. Zapytania proste z wyrażeniami 12. Zapytania z użyciem funkcji agregujących i grupowaniem 13. Zapytania ze złączeniami 14. Zapytania zagnieżdżone 15. Instrukcje aktualizacji, usuwania i wstawiania masowego 16. Widoki, operacje na widokach 17. Normalizacja relacyjnych baz danych 18. Identyfikacja, uwierzytelnienie i autoryzacja w bazach danych",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Brak wymagań",
        "lista_lektur": "Podstawowa lista lektur P.Beynon-Davies. \"Systemy baz danych\". WNT 2000.  C.J.Date. \"Wprowadzenie do systemów baz danych\". WNT 2000. M.Gruber. \"SQL\", wydanie drugie. Helion 2000 K.Goczyła. \"Bazy danych\". Materiały do wykładu. Gdańsk. Uzupełniająca lista lektur Brak",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Skonstruuj model związków encji dla przykładowej sytuacji  2. Skonstruuj i utwórz relacyjną bazę danych 3. Sformułuj zapytania do relacyjnej bazy danych 4. Wymień operatory algebry relacji 5. Podaj powody naruszenia drugiej i trzeciej postaci normalnej 6. Dokonaj normalizacji przykładowej bazy danych",
        "plik": "373729.pdf"
    },
    {
        "nazwa_przedmiotu": "Data warehouses,",
        "kod_przedmiotu": "PG_00064166",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2026/2027",
        "rok": "3",
        "semestr": "5",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Wydział Elektroniki, Telekomunikacji i Informatyki -> Katedra Inżynierii Oprogramowania",
        "cel_przedmiotu": "Celem przedmiotu jest zapoznanie studenta z pojęciem hurtowni danych, z jej zastosowaniami, z metodami konstrukcji hurtowni danych i ich odpytywania. Student poznaje także podstawy i narzędzia typu business intelligence.",
        "efekty_uczenia_sie": "[K6_U05] projektuje innowacyjne rozwiązania analizy i przetwarzania danych, wykorzystując odpowiednie metody i narzędzia Student projektuje rozwiązania Business Intelligence w oparciu o architekturę Ralpha Kimballa. [SU1] Ocena realizacji zadania [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU4] Ocena umiejętności korzystania z metod i narzędzi [K6_W05] integruje dane z wielu źródeł w celu analizy złożonych problemów biznesowych Student potrafi projektować i implementować procesy ETL (Extract, Transform and Load) dla hurtowni danych ze źródeł o różnej strukturze. [SW1] Ocena wiedzy faktograficznej [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_K03] wykazuje się zdolnością do krytycznego i analitycznego myślenia oraz integruje wiedzę z wielu dyscyplin w celu podejmowania efektywnych decyzji Student potrafi analizować procesy biznesowe w celu dostarczenia rozwiązań typu Businness Intelligence. Ponadto, student potrafi analizować dane powstające w trakcie wykonywania procesów biznesowych pod względem ich kompletności dla analiz biznesowych. [SK5] Ocena umiejętności rozwiązywania problemów występujących w praktyce  Data wygenerowania: 12.02.2025 10:53 Strona 2 z 3",
        "tresc_przedmiotu": "1. Podstawowe pojęcia dotyczące hurtowni danych  2. Wielowymiarowy model danych w hurtowniach danych. Wymiary kategoryjne i hierarchiczne. 3. Schemat gwiazdy i schemat płatka śniegu. Schemat konstelacji. 4. Podstawowe operacje na kostkach OLAP 5. Modele pamięci w hurtowniach danych 6. Architektura rozwiązań typu Business Intelligence. 7. Zasady tworzenia hurtowni danych. 8. Język MDX - zapytania proste i złożone 9. Procesy ETL (Extract, Transform, Load) 10. Systemy raportowania",
        "formy_zajec": "Wykład: 15.0 Ćwiczenia: 0.0 Laboratorium: 30.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 45.0",
        "wymagania_wstepne": " Ukończony podstawowy kurs baz danych",
        "lista_lektur": "Podstawowa lista lektur W.H. Inmon: Building the Data Warehouse. J. Wiley&Sons,  R. Kimball: Data Warehouse Toolkit. J. Wiley&Sons, P. Ponniah: Data Warehousing. J. Wiley&Sons, . K. Goczyła. T. Zawadzka. \"Hurtownie danych\". Materiały do wykładu. V. Poe, P. Klauer, S. Brebst: Tworzenie hurtowni danych, WNT Uzupełniająca lista lektur Nie ma",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania 1. Zaprojektuj hurtownię danych wg podanych założeń  2  Zrealizuj hurtownię danych i przetestuj jej funkcjonowanie 3. Wytłumacz różnice pomiędzy przetwarzaniem OLAP a przetwarzaniem OLTP 4. Podaj najważniejsze cechy hurtowni danych 5. Czym się różni schemat gwiazdy od schematu płatka śniegu? 6. Podaj rozszerzenia OLAP-owe języka SQL 7. Na czym polega proces ETL?",
        "plik": "374134.pdf"
    },
    {
        "nazwa_przedmiotu": "English III,",
        "kod_przedmiotu": "PG_00055632",
        "kierunek": "Inżynieria danych",
        "poziom_ksztalcenia": "I stopnia - inżynierskie",
        "rok_akademicki": "2025/2026",
        "rok": "2",
        "semestr": "4",
        "jezyk": "angielski",
        "forma_studiow": "stacjonarne",
        "jednostka_prowadzaca": "Prorektor Ds. Kształcenia -> Centrum Języków Obcych",
        "cel_przedmiotu": "Opanowanie przez studentów języka angielskiego na poziomie B2 lub C1. Kurs obejmuje treści biznesowe.",
        "efekty_uczenia_sie": "[K6_K82] posiada przygotowanie do uczestniczenia w wykładach, seminariach, laboratoriach prowadzonych w języku obcym Student / ka potrafi porozumiewać się z członkami zespołu i grupy w dyskusji / debacie oraz w konwersacji twarzą w twarz, poprzez e-maile, rozmowy teleefoniczne - w środowisku zawodowym i akademickim. [SK2] Ocena postępów pracy [SK1] Ocena umiejętności pracy w grupie [K6_W81] posiada znajomość struktur gramatycznych oraz obszarów leksykalnych niezbędnych do porozumiewania się w języku obcym w zakresie języka ogólnego oraz specjalistycznego związanego z kierunkiem studiów Rozumienie literatury specjalistycznej. Tłumaczenie krótkich tekstów specjalistycznych. Pisanie streszczeń tekstów specjalistycznych. [SW3] Ocena wiedzy zawartej w opracowaniu tekstowym i projektowym [K6_U82] potrafi pozyskiwać i przetwarzać informacje w języku obcym na poziomie B2 Europejskiego Systemu Opisu Kształcenia Językowego dotyczące kierunku studiów oraz środowiska akademickiego Rozwinięcie i konsolidacja znajomości języka angielskiego w zakresie czytania, mówienia, słuchania, pisania i tłumaczenia. [SU3] Ocena umiejętności wykorzystania wiedzy uzyskanej w ramach przedmiotu [SU1] Ocena realizacji zadania  Data wygenerowania: 31.05.2025 12:40 Strona 2 z 2",
        "tresc_przedmiotu": "Słownictwo: Wprowadzenie słownictwa specjalistycznego z dziedziny zarządzania, ekonomii, marketingu i finansów. Gramatyka: Realizowanie gramatyki w zakresie wymaganym dla danego poziomu znajomości języka niezbędnego do komunikacji werbalnej i pisemnej w środowisku świata pracy. Pisanie: Ćwiczenie umiejętności pisania różnorodnych tekstów, niezbędnych w pracy np.: raportu, życiorysu zawodowego, wiadomości email, streszczenia, notatki, abstraktu, instrukcji, objaśnienia procesu. Czytanie: Pogłębianie umiejętności czytania ze zrozumieniem tekstów bazujących na materiałach źródłowych z dziedziny zarządzania, ekonomii, marketingu i finansów. Słuchanie: Rozwijanie umiejętności słuchania w oparciu o materiały przedstawiające sytuacje związane ze środowiskiem pracy i życiem codziennym, np.: rozmowy telefoniczne, wywiady, sytuacje związane z obsługą klienta, wykłady oraz prezentacje. Mówienie: Ćwiczenie umiejętności komunikacji takich jak: rozmowa kwalifikacyjna, rozmowy formalne i nieformalne, negocjacje, przedstawianie argumentów, rozwiązywanie problemów, case studies, prowadzenie spotkań formalnych. Ćwiczenie wymowy i prawidłowego akcentowania wyrazów.",
        "formy_zajec": "Wykład: 0.0 Ćwiczenia: 30.0 Laboratorium: 0.0 Projekt: 0.0 Seminarium: 0.0 RAZEM: 30.0",
        "wymagania_wstepne": " Opanowanie przez studentów języka angielskiego na poziomie B2 lub C1. Kurs obejmuje treści biznesowe.",
        "lista_lektur": "Podstawowa lista lektur Market Leader 3rd Edition Extra (Upper-Intermediate / Advanced) + Business English Practice File, Education Ltd, Harlow, England, 2016 Uzupełniająca lista lektur Advanced Language Practice (Michael Vince) Business Benchmark Upper-Intermediate / Advanced BEC Vantage Testbuilder BEC Higher Testbuilder",
        "przykladowe_zagadnienia": "przykładowe pytania/ realizowane zadania słownictwo związane z marketingiem pisanie raportu negocjowanie kontraktu",
        "plik": "390690.pdf"
    }
]